[
  {
    "eventId": "38368935",
    "title": "\"Planar Fissure 300%\" Event: Planar Ornaments Drop Rate Tripled for a Limited Time",
    "description": "▌ Event Period 2025/04/23 04:00:00 - 2025/05/05 03:59:00 (server time) ▌Participation Requirements Unlock \"Simulated Universe: World 3\" ▌ Event Details ● During the \"Planar Fissure\" event, get triple rewards from the Simulated Universe or Divergent Universe. ●You will get two additional rewards on top of default drops after consuming an event triple reward opportunity and Immersifiers (or Trailblaze Power). ● During the event, the number of triple reward opportunities is limited and can be viewed in the Planar Fissure event page. ●The triple reward count will not reset during the event. Be sure to schedule your time for this challenge accordingly, Trailblazers.",
    "startDate": "2025-04-23T04:00:00",
    "endDate": "2025-05-05T03:59:00",
    "startTimestamp": 1745377200000,
    "endTimestamp": 1746413940000,
    "lastUpdated": "2025-04-24T20:39:28.894271",
    "sentiment": "negative",
    "imageUrl": "/assets/images/events/event_38368935.png"
  },
  {
    "eventId": "38119901",
    "title": "Version 3.2 \"Through the Petals in the Land of Repose\" Update Details",
    "description": "Those from the past rush by in a fleeting lifetime, those from the future stretch into an endless night — oh, lost wanderer, cross that uncharted River of Souls, and step into the blooming fields of Antila flowers. Hello, Trailblazers! Welcome to Version 3.2 \"Through the Petals in the Land of Repose\"! ▌ Update and Compensation Details ■ Update Time Begins at 2025/04/09 06:00:00 (UTC+8). The update will take approximately 5 hours. ■ Compensation Details ●Server Maintenance Compensation Compensation: Stellar Jade ×300 Eligible Recipients: Trailblazers with Trailblaze Level ≥ 4 before 2025/04/09 06:00:00 (UTC+8) ※ Please claim before the end of Version 3.2. ●Bug Compensation Compensation: Stellar Jade ×300 Eligible Recipients: Trailblazers with Trailblaze Level ≥ 4 before 2025/04/09 06:00:00 (UTC+8) ※ Please log in to claim the mail before 2025/05/09 23:59:00 (UTC+8). The Crew will issue the compensation via in-game mail to Trailblazers within 5 hours after the update. Be sure to claim it in time. ■ How to Update PC: Exit the game, restart the launcher, then click \"Update\" Android: Enter the game and follow the instructions in the in-game pop-up window to complete the update iOS: Enter the App Store and tap \"Update\" PS5®: After entering the game, the game will automatically download and install the update ▌Version Update Details 1. New Story ■ Trailblaze Mission \"Amphoreus — Through the Petals in the Land of Repose\" Those from the past rush by in a fleeting lifetime, those from the future stretch into an endless night — oh, lost wanderer, cross that uncharted River of Souls, and step into the blooming fields of Antila flowers. Update Time: Available after the Version 3.2 update Requirement: Complete the Trailblaze Mission \"Amphoreus\" - \"Passage, Reveal the Past Once More\" ※ Amphoreus Trailblaze Missions can be experienced in advance through the \"Finality's Vision: Leap of Trailblaze\" function. 2. New Characters ■ 5-Star character Castorice (Remembrance: Quantum) Castorice is a DPS who fights alongside her summoned memosprite \"Netherwing,\" which consumes its own HP to deal damage to enemies. The more HP consumed, the higher the damage. In combat, \"Netherwing\" can also take damage for endangered allies. ■ 5-Star character Anaxa (Erudition: Wind) Anaxa is a DPS who can rapidly inflict multiple Weaknesses on enemies. Attacking enemies with multiple Weaknesses triggers a Skill that consumes no Skill Points. Using the Ultimate directly applies 7 types of Weaknesses to all enemies. 3. New Light Cones ■ 5-Star Make Farewells More Beautiful (Remembrance) Obtainable through the \"Brilliant Fixation: Make Farewells More Beautiful\" Light Cone Event Warp. ■ 5-Star Life Should Be Cast to Flames (Erudition) Obtainable through the \"Brilliant Fixation: Life Should Be Cast to Flames\" Light Cone Event Warp. ■ 4-Star The Great Cosmic Enterprise (Erudition) Obtainable through the \"Star Rail WORLD\" event. 4. New Areas ■ \"Demigod Council\" Dawncloud The spiritual and political center of Okhema, where priests gaze upon the Worldbearing Titan, and Elders debate endlessly in the circular assembly hall. ■ \"Dragonbone City\" Styxia This land of the undead was once Styxia, \"City-State of Dragons and Waves.\" Phagousa ultimately could not grant blessings for the River of Souls. Over time, people gradually began to forget. 5. New Events ■ Festive Gifts Log in every day during the event to obtain check-in rewards. Trailblazers can claim Star Rail Special Pass ×20 after checking in for 7 days! Event Period: After the Version 3.2 update – 2025/05/20 03:59:00 (server time) Requirement: Unlock Travel Log ■ To The Ones That Blaze After the event begins, Trailblazers can invite a familiar companion to send you special anniversary blessings. On Honkai: Star Rail's two-year anniversary (2025/04/26 12:00:00 (UTC+8)), Trailblazers will receive a letter from their chosen companion along with gifts of Stellar Jade ×1,600 and Fuel ×10. Event Period: After Version 3.2 Update — 2025/05/21 06:00:00 (UTC+8) Reward Collection: 2025/04/26 12:00:00 — 2025/05/21 06:00:00 (UTC+8) Requirement: Unlock Travel Log ■ Stellar Companions During the event, Trailblazers can directly claim \"Golden Companion Spirit\" ×1. Event Period: After the V3.2 update – end of V3.4 Requirement: Unlock Travel Log ■ Star Rail WORLD The Astral Express has received yet another package — this time a gift prepared by a game developer... Event Period: After the Version 3.2 update – 2025/05/19 03:59:00 (server time) Requirement: Trailblaze Level ≥ 21 ■ Seal Slammers During this Month of Joy blessed by the Chalice of Plenty, the Court of Seasons is preparing a wild festival featuring baby seals and aquatic bumping! As the legendary Child of Prophecy, how could you possibly miss out? Event Period: 2025/04/11 12:00:00 — 2025/05/19 03:59:00 (server time) Requirement: Trailblaze Level ≥ 21 ※ This content can be experienced in advance through the Finality's Vision function. ※ It's recommended that Trailblazers experience this content after finishing the Trailblaze Mission \"Amphoreus — Witch's Mirrored Reversal.\" ■ Morning Starlight What mysterious experiment are the space station researchers cooking up this time? Word is they specifically requested your participation. You can't shake off this feeling of déjà vu, reminding you of a certain Madam Herta who's too lazy to reveal her full name... Event Period: 2025/04/28 12:00:00 — 2025/05/19 03:59:00 (server time) Requirement: Trailblaze Level ≥ 21 ※ Please refer to future announcements for information on other events. 6. Others ■ Enemies \"Pollux, Netherwing Husk, Ferry of Souls\" \"Fulminating Wolflord\" \"Black Tide's Corroded Daemon\" \"Black Tide's Corroded Axe\" ■ Gameplay Treasures Lightward: Regular game modes Apocalyptic Shadow, Pure Fiction, and Forgotten Hall: Memory of Chaos will be refreshed alternately. For more details, see below: ● Apocalyptic Shadow: Warlord of the Locusts 2025/04/14 04:00:00 – 2025/05/26 03:59:00 (server time) When an enemy unit with \"Steadfast Safeguard\" is Weakness Broken, dispel control debuff for all allies, immediately take action, and restore HP. Increases the Memosprite Skill DMG taken by all enemies by 25% and increases Skill DMG taken by 15%. ● Pure Fiction: Structural Rules 2025/04/28 04:00:00 - 2025/06/09 03:59:00 (server time) After allies use Skill to attack enemy targets, every enemy target hit additionally accumulates 5 Grit Value for allies. ● Memory of Chaos: Breath of the Othershore 2025/05/12 04:00:00 – 2025/06/23 03:59:00 (server time) All allies' Skill Lv. +3 and Memosprite Skill Lv. +2. After any character uses their Skill or Memosprite Skill, 1 random attacked target gains 1 random Weakness they did not already possess. At the beginning of each Cycle, \"Memory Turbulence\" deals 1 instance of True DMG to all enemy targets. If a target has 3 or more Weaknesses, deals 1 additional instance of True DMG for each additional Weakness. ■ System A \"Relic Finalization Settings\" button has been added to the entry interface of \"Cavern of Corrosion\", \"Planar Ornament Extraction\", and \"Echo of War\" stages, allowing you to set which Relics will be automatically salvaged upon battle completion. Adds \"Smart Discard\" function for Relics: When salvaging Relics, by checking the corresponding options, the system can, based on player analytics, automatically filter and mark \"Discard\" Relics whose Main Stats don't match any recommended characters and have little hit counts on Subsidiary Stats. Adds \"Mass Superimposition\" feature for Light Cones: You can set different superimposition schemes to quickly superimpose 4-star Light Cones of the same name in your inventory. ■ Others Adds new shop \"Stellar Convergence\" and exchangeable items in shop: Limited 5-star characters \"Ruan Mei (Harmony: Ice),\" \"Luocha (Abundance: Imaginary),\" standard 5-star characters, Variable Dice; Limited 5-star Light Cones \"Past Self in Mirror (Harmony),\" \"She Already Shut Her Eyes (Preservation),\" \"The Unreachable Side (Destruction),\" \"Echoes of the Coffin (Abundance),\" \"In the Night (The Hunt),\" and standard 5-star Light Cones. New items \"Golden Companion Spirit\" and \"Light Cone Memory Shard\": Use 1 \"Golden Companion Spirit\" to exchange for one 5-star character in the \"Stellar Convergence\" shop; use 4 \"Light Cone Memory Shards\" to exchange for one 5-star Light Cone in the \"Stellar Convergence\" shop. New item \"Silver Companion Spirit\": Every 2 \"Silver Companion Spirits\" can be exchanged for 1 \"Golden Companion Spirit.\" Adds new content such as \"As I've Written,\" World Shop \"Tidal Bounty,\" readable items, Messages, discs, Achievements, data bank entries, and loading screen texts. They will be gradually unlocked during your Trailblaze Progress. New Limited-Time Bundles: \"Special Ticket\" and \"Trailblaze Assistance.\" Adds the \"Phone Case\" tab in the Phone > Phone Decoration interface. You can check and switch the phone cases used by the Trailblazer. Adds \"Namecard Settings\" function in the \"Trailblazer Profile.\" You can switch your \"Trailblazer Profile\" namecard and view the preview effects for namecards in the Friend List. ▌ Adjustments and Optimizations ■ Combat Adjusts target selection logic for certain characters during auto-battle under specific conditions. Adjusts the descriptive text for the \"Departed\" state. ■ Missions Adjusts the performance of the Version 3.0 Trailblaze Mission \"Amphoreus — Heroic Saga of Flame-Chase.\" Optimizes certain mission flow, including reducing dialogues, and rendering certain dialogues and mission sequences as optional content, made specific puzzles skippable, and simplified the process of solving certain puzzles, etc. ■ Events Optimizes the \"Aptitude Showcase\" character trial event. After the optimizations, in the Trial Stages, you can view battle summaries and ability descriptions for all characters in your set lineup. Before combat begins, you can switch characters within the team and activate their Techniques. Once combat starts, the Auto-Battle feature becomes available. Some Trial Stages require completing the tutorial phase before unlocking character switching and Auto-Battle functions. Starlit Homecoming Event Optimizations: Newly added Homecoming Assistance can grant a designated and owned character a set of Main Stat and Relic set appropriate 4-star Relics. A Gift for Returners now includes an additional reward of \"Fuel Voucher\" ×100. You can use Fuel Vouchers along with Trailblaze Power to Quick Farm materials from Calyx/Stagnant Shadow. When you Quick Farm, each Trailblaze Power ×10 consumed requires Fuel Voucher ×1. ■ System Character Warp optimization. After the optimization, Trailblazers can select seven non-featured 5-Star characters in the Character Event Warp. The first batch of customizable non-featured 5-Star characters includes: limited 5-Star characters \"Fu Xuan (Preservation: Quantum),\" \"Blade (Destruction: Wind),\" \"Seele (The Hunt: Quantum),\" and seven standard 5-Star characters. Trailblazers can select a total of seven characters from these ten 5-Star characters to add to the list. 5-Star Character Eidolon Overflow optimization. After optimization, when Trailblazers obtain a 5-Star character (including limited and standard) with max Eidolons, they will receive 1 additional \"Silver Companion Spirit.\" For Eidolon overflow that occurred before Version 3.2, corresponding amounts of \"Silver Companion Spirit\" will be distributed after the Version 3.2 update. Adds text descriptions to certain sections in the Character Event Warp \"Details\" interface. These changes do not affect the actual warp probability, which remains consistent with previous versions. Improves the \"Supplement Materials\" feature when consuming materials for upgrades. After optimization, when you don't have enough of the required materials but possess the corresponding amount of lower rarity or universal materials, you can directly go to the \"Material Synthesis\" button on the material consumption interface to auto-complete the materials, without having to go to the \"Synthesis\" interface. Optimizes the character selection Catalog display sequence for the \"Build Target\" in the Interastral Peace Guide. After the optimizations, owned \"Warp\" characters will be displayed with priority among \"My Characters.\" ● From 2025/04/26 00:00:00 (server time), the birthday cake in the birthday mail will switch from \"Wayfare's Blessing\" to \"Golden Blessing\". ※ The time the birthday cake switches over is not identical across all servers. Please refer to the times below: Asia: 2025/04/26 00:00 (server time) TW,HK,MO: 2025/04/26 00:00 (server time) America: 2025/04/25 00:00 (server time) Europe: 2025/04/26 00:00 (server time) ■ Audio Adjusts and optimizes some dialogue voice lines in the mission flow of Trailblaze Mission \"Amphoreus — Wasteland, Hark Back Glory of Old/Kremnos, Cleanse Thy Rusted Blood (II)/Strife, Dispel the Accompanying Fears/Glory, Turn From Imbibed Poison/Grove, Wherefore Are the Wise Silent/Nemesis, Scorched by Golden Blood\" when the voice language is set to English. Optimizes some Japanese character voice lines for the character Herta (Erudition: Ice). Adjusts and optimizes some dialogue voice lines in the mission flow of Trailblaze Mission \"Amphoreus - Distant Travelers, Listen to this World's Prayer/Kremnos, Cleanse Thy Rusted Blood/Memories, Veiled in Blazing Mist/Passages, Knocking Echoes in Dreams/Passage, Reveal the Past Once More\" when the voice language is set to Japanese. Optimizes certain story voice lines in the \"Demised Scholar\" story in \"As I've Written — Amphoreus' Saga of Heroes\" when the voice language is set to Japanese. Optimizes some Japanese environmental voice lines in the Eternal Holy City Okhema map. Optimizes some dialogue voice lines for NPC Aechenus and Tides of the Basin when the voice language is set to Japanese. Adjusts and optimizes some Korean character voice lines for the character Tribbie (Harmony: Quantum). Adjusts and optimizes some dialogue voice lines in the mission flow of Trailblaze Mission \"Amphoreus — Night Stars, Accompany My Slumber/Glory, Turn From Imbibed Poison/Grove, Wherefore Are the Wise Silent/Passage, Reveal the Past Once More\" when the voice language is set to Korean. Optimizes some Korean dialogue voice lines in the mission flow of the Companion Mission \"Swords to Plowshares.\" Adjusts and optimizes certain story voice lines in the \"Demised Scholar\" and \"Triplets of Fate\" story in \"As I've Written — Amphoreus' Saga of Heroes\" when the voice language is set to Korean. ■ Others Adjusts the descriptions for completing some Achievements, which does not affect the actual requirements to complete them. Resets the double bonus count of the first Oneiric Shard top-up for each rank in the \"Shop\" — \"Oneiric Pouch\" interface. Adjusts some tabs in \"Shop\": The \"Starlight Exchange\" and \"Embers Exchange\" tabs have been merged into the \"Exchange Shop\" tab. Adjusts the reward rank at Honor Level 10 of \"Nameless Glory\", adding 1 \"Light Cone Memory Shard.\" Adjusts the immediate rewards when unlocking the \"Nameless Medal,\" adding 1 \"Light Cone Memory Shard.\" Some original rank rewards have also been adjusted. Adjusts the name of \"Echo of War: Borehole Planet's Old Crater\": The stage name has been changed to \"Echo of War: Borehole Planet's Past Nightmare.\" Adjusts shadow effects for certain NPCs. ▌ Bug Fixes ■ Characters and Enemies Fixes an issue where the character Mydei (Destruction: Imaginary)'s specific ability may experience abnormalities when he receives a killing blow and exits \"Vendetta\" state under certain conditions. Fixes the issue where some Break DMG Boost effects do not work on the additional Break DMG dealt by Ruan Mei (Harmony: Ice)'s Talent and Technique under certain circumstances. Fixes an issue where, under certain circumstances, after the character Ruan Mei (Harmony: Ice) uses her Ultimate, the ally memosprite detail menu does not display this ability's buffs. This issue does not affect the actual gameplay performance. Fixes an issue where character lighting effects would appear abnormal after teleporting via Space Anchor under specific graphics settings. Fixes issues for certain abnormal character, NPC, and enemy models, visual effects, and movement effects. Fixes an issue where the \"Titanic Corpus\" effect description was incorrect for the enemy \"Savage God, Mad King, Incarnation of Strife\" and \"Savage God, Mad King, Incarnation of Strife (Complete).\" This issue did not affect its actual functionality. Fixes an issue where some graphics are displayed abnormally when Noontide Gryphon or Moonlit Pegasus uses an ability in some circumstances. Fixes an issue where the UI of some skills abnormally remains when the enemy \"The Giver, Master of Legions, Lance of Fury\" enters the next phase under certain circumstances. Fixes an issue where some \"Synthesis Materials\" are dropped abnormally when the enemy Tide-Eroded Blade is defeated in some circumstances. Fixes an issue when the enemies \"Borisin Warhead: Hoolay,\" \"Borisin Warhead: Hoolay (Complete),\" \"Sableclaw Wolftrooper,\" and \"Eclipse Wolftrooper\" are Taunted by allies, the \"Taunt\" state effect is not displayed. This issue does not affect the actual gameplay performance. ■ Combat Fixes an issue where certain visual effects and text descriptions in the Action Order would display abnormally under specific circumstances. Fixes an issue where, under certain circumstances, the water reflection effect was missing from the ability scene after character Acheron (Nihility: Lightning) used her Ultimate. Fixes an issue where, when battling the enemy \"The Giver, Master of Legions, Lance of Fury\", Moze (The Hunt: Lightning) was unable to restore Max HP under certain circumstances. Fixes an issue where, in combat, some ability effects of the Light Cone \"River Flows in Spring (The Hunt)\" did not match their text descriptions. After the fix, the effects will be consistent with the text descriptions. Fixes the issue where, after the Slow effect of the Light Cone Whereabouts Should Dreams Rest (Destruction) is triggered, there's a chance that the Slow effect will abnormally not be recognized under certain circumstances. ■ Missions Fixes an issue where certain mission storyline progressions were glitched in specific circumstances. ■ Gameplay Fixes an issue where sound effects would occasionally be missing when advancing Astronomical Division levels in \"Divergent Universe: Protean Hero.\" Fixes an issue with incorrect text descriptions in the \"Stable Computing Array\" interface of \"Divergent Universe: Protean Hero.\" This issue does not affect the actual reward acquisition. Fixes an issue in Simulated Universe: Protean Hero and Simulated Universe: Unknowable Domain where the DMG effects of certain ally attacks are abnormal when fighting the enemy \"Cirrus (Complete)\" under specific circumstances. Fixes an issue where when characters are downed or a memosprite disappears, this might abnormally Charge \"Soul Chrysalis\" under certain special circumstances in Divergent Universe: Protean Hero. ■ System Fixes an issue where some text in the memosprite \"View Details\" interface would occasionally display incorrectly. This issue did not affect the actual stats of memosprites. Fixes an issue where interface text could display abnormally when synthesizing Relics using \"Relic Remains\" under specific circumstances. This issue did not affect the actual materials consumed. Fixes an issue where the \"Build Guide\" interface displayed abnormally under certain circumstances. ■ Audio Fixes an issue where some music and sound effects perform abnormally under specific conditions. Fixes an issue where some voice lines were missing in the \"Weaver of Gold\" story in \"As I've Written\" — \"Amphoreus' Saga of Heroes\" when the voice language is set to Chinese. Fixes an issue where the pronouns for the Flame Reaver were incorrect in the mission flow of Trailblaze Mission \"Amphoreus — Passages, Knocking Echoes in Dreams/Grove, Wherefore Are the Wise Silent\" when the voice language is set to English. Fixes an issue where some dialogue voice lines were incorrect in the mission flow of Trailblaze Mission \"Amphoreus — Throne, End Those Long Years Forlorn\" when the voice language is set to Japanese. Fixes an issue where some voice lines were incorrect in the \"Servant of Death\" story in \"As I've Written\" — \"Amphoreus' Saga of Heroes\" when the voice language is set to Japanese. Fixes an issue where some dialogue voice lines were missing in the mission flow of Trailblaze Mission \"Amphoreus — Passage, Reveal the Past Once More\" when the voice language is set to Korean. Fixes an issue where some dialogue voice lines were abnormal in the mission flow of Trailblaze Continuance \"The Xianzhou Luofu — At Dawn, To War\" when the voice language is set to Korean. Fixes an issue where some voice lines were incorrect in the \"Servant of Death\" story in \"As I've Written\" — \"Amphoreus' Saga of Heroes\" when the voice language is set to Korean. ■ Others Fixed an issue where the color of certain chimera models are abnormal after the V3.1 update. The models now remain consistent with V3.0. Fixes an issue where Trailblazers on the PC platform could not close the \"Quick Recover\" popup for replenishing Technique Points using the \"ESC\" button under certain circumstances. Fixes an issue where there is a certain chance that the \"Cerces' Incomplete Theorem\" Achievement cannot be completed under specific circumstances. Fixes an issue where you will be unable to obtain the completion progress for the \"Day of the Triffids (I), (II), and (III)\" Achievements after clearing certain special \"Calyx\" series stages. In-game texts for 13 languages have been optimized and fixed. These changes do not affect the actual effects. Trailblazers can switch the game language through \"Phone — Settings — Language\" and view the corresponding changes in the announcement. Fixes and optimizations in English include the following (they have no impact on the actual in-game effects): Adjusts and optimizes various text descriptions, readable items, Messages, item names, mission summaries, Navigation introductions, Status Effects, tutorials, system notifications, Titan introductions in \"Voice of Constellation,\" and gameplay text and text descriptions, etc. Fixes errors in some of the text pertaining to the character Trailblazer's introduction. Optimizes some descriptions related to \"Follow-up ATK\".\n▌ Event Details\nThose from the past rush by in a fleeting lifetime, those from the future stretch into an endless night — oh, lost wanderer, cross that uncharted River of Souls, and step into the blooming fields of Antila flowers.\n\nHello, Trailblazers!\nWelcome to Version 3.2 \"Through the Petals in the Land of Repose\"!\n\n▌ Update and Compensation Details\n■ Update Time\nBegins at 2025/04/09 06:00:00 (UTC+8). The update will take approximately 5 hours.\n\n■ Compensation Details\n●Server Maintenance Compensation\nCompensation: Stellar Jade ×300\nEligible Recipients: Trailblazers with Trailblaze Level ≥ 4 before 2025/04/09 06:00:00 (UTC+8)\n※ Please claim before the end of Version 3.2.\n\n●Bug Compensation\nCompensation: Stellar Jade ×300\nEligible Recipients: Trailblazers with Trailblaze Level ≥ 4 before 2025/04/09 06:00:00 (UTC+8)\n※ Please log in to claim the mail before 2025/05/09 23:59:00 (UTC+8).\n\nThe Crew will issue the compensation via in-game mail to Trailblazers within 5 hours after the update. Be sure to claim it in time.\n\n■ How to Update\nPC: Exit the game, restart the launcher, then click \"Update\"\nAndroid: Enter the game and follow the instructions in the in-game pop-up window to complete the update\niOS: Enter the App Store and tap \"Update\"\nPS5®: After entering the game, the game will automatically download and install the update\n\n▌Version Update Details\n1. New Story\n■ Trailblaze Mission \"Amphoreus — Through the Petals in the Land of Repose\"\nThose from the past rush by in a fleeting lifetime, those from the future stretch into an endless night — oh, lost wanderer, cross that uncharted River of Souls, and step into the blooming fields of Antila flowers.\nUpdate Time: Available after the Version 3.2 update\nRequirement: Complete the Trailblaze Mission \"Amphoreus\" - \"Passage, Reveal the Past Once More\"\n※ Amphoreus Trailblaze Missions can be experienced in advance through the \"Finality's Vision: Leap of Trailblaze\" function.\n\n2. New Characters\n■ 5-Star character Castorice (Remembrance: Quantum)\nCastorice is a DPS who fights alongside her summoned memosprite \"Netherwing,\" which consumes its own HP to deal damage to enemies. The more HP consumed, the higher the damage. In combat, \"Netherwing\" can also take damage for endangered allies.\n\n■ 5-Star character Anaxa (Erudition: Wind)\nAnaxa is a DPS who can rapidly inflict multiple Weaknesses on enemies. Attacking enemies with multiple Weaknesses triggers a Skill that consumes no Skill Points. Using the Ultimate directly applies 7 types of Weaknesses to all enemies.\n\n3. New Light Cones\n■ 5-Star Make Farewells More Beautiful (Remembrance)\nObtainable through the \"Brilliant Fixation: Make Farewells More Beautiful\" Light Cone Event Warp.\n\n■ 5-Star Life Should Be Cast to Flames (Erudition)\nObtainable through the \"Brilliant Fixation: Life Should Be Cast to Flames\" Light Cone Event Warp.\n\n■ 4-Star The Great Cosmic Enterprise (Erudition)\nObtainable through the \"Star Rail WORLD\" event.\n\n4. New Areas\n■ \"Demigod Council\" Dawncloud\nThe spiritual and political center of Okhema, where priests gaze upon the Worldbearing Titan, and Elders debate endlessly in the circular assembly hall.\n\n■ \"Dragonbone City\" Styxia\nThis land of the undead was once Styxia, \"City-State of Dragons and Waves.\" Phagousa ultimately could not grant blessings for the River of Souls. Over time, people gradually began to forget.\n\n5. New Events\n■ Festive Gifts\nLog in every day during the event to obtain check-in rewards. Trailblazers can claim Star Rail Special Pass ×20 after checking in for 7 days!\nEvent Period: After the Version 3.2 update – 2025/05/20 03:59:00 (server time)\nRequirement: Unlock Travel Log\n\n■ To The Ones That Blaze\nAfter the event begins, Trailblazers can invite a familiar companion to send you special anniversary blessings. On Honkai: Star Rail's two-year anniversary (2025/04/26 12:00:00 (UTC+8)), Trailblazers will receive a letter from their chosen companion along with gifts of Stellar Jade ×1,600 and Fuel ×10.\nEvent Period: After Version 3.2 Update — 2025/05/21 06:00:00 (UTC+8)\nReward Collection: 2025/04/26 12:00:00 — 2025/05/21 06:00:00 (UTC+8)\nRequirement: Unlock Travel Log\n\n■ Stellar Companions\nDuring the event, Trailblazers can directly claim \"Golden Companion Spirit\" ×1.\nEvent Period: After the V3.2 update – end of V3.4\nRequirement: Unlock Travel Log\n\n■ Star Rail WORLD\nThe Astral Express has received yet another package — this time a gift prepared by a game developer...\nEvent Period: After the Version 3.2 update – 2025/05/19 03:59:00 (server time)\nRequirement: Trailblaze Level ≥ 21\n\n■ Seal Slammers\nDuring this Month of Joy blessed by the Chalice of Plenty, the Court of Seasons is preparing a wild festival featuring baby seals and aquatic bumping! As the legendary Child of Prophecy, how could you possibly miss out?\nEvent Period: 2025/04/11 12:00:00 — 2025/05/19 03:59:00 (server time)\nRequirement: Trailblaze Level ≥ 21\n※ This content can be experienced in advance through the Finality's Vision function.\n※ It's recommended that Trailblazers experience this content after finishing the Trailblaze Mission \"Amphoreus — Witch's Mirrored Reversal.\"\n\n■ Morning Starlight\nWhat mysterious experiment are the space station researchers cooking up this time? Word is they specifically requested your participation. You can't shake off this feeling of déjà vu, reminding you of a certain Madam Herta who's too lazy to reveal her full name...\nEvent Period: 2025/04/28 12:00:00 — 2025/05/19 03:59:00 (server time)\nRequirement: Trailblaze Level ≥ 21\n\n※ Please refer to future announcements for information on other events.\n\n6. Others\n■ Enemies\n\"Pollux, Netherwing Husk, Ferry of Souls\" \"Fulminating Wolflord\" \"Black Tide's Corroded Daemon\" \"Black Tide's Corroded Axe\"\n\n■ Gameplay\nTreasures Lightward: Regular game modes Apocalyptic Shadow, Pure Fiction, and Forgotten Hall: Memory of Chaos will be refreshed alternately. For more details, see below:\n\n● Apocalyptic Shadow: Warlord of the Locusts\n2025/04/14 04:00:00 – 2025/05/26 03:59:00 (server time)\nWhen an enemy unit with \"Steadfast Safeguard\" is Weakness Broken, dispel control debuff for all allies, immediately take action, and restore HP.\nIncreases the Memosprite Skill DMG taken by all enemies by 25% and increases Skill DMG taken by 15%.\n\n● Pure Fiction: Structural Rules\n2025/04/28 04:00:00 - 2025/06/09 03:59:00 (server time)\nAfter allies use Skill to attack enemy targets, every enemy target hit additionally accumulates 5 Grit Value for allies.\n\n● Memory of Chaos: Breath of the Othershore\n2025/05/12 04:00:00 – 2025/06/23 03:59:00 (server time)\nAll allies' Skill Lv. +3 and Memosprite Skill Lv. +2. After any character uses their Skill or Memosprite Skill, 1 random attacked target gains 1 random Weakness they did not already possess.\nAt the beginning of each Cycle, \"Memory Turbulence\" deals 1 instance of True DMG to all enemy targets. If a target has 3 or more Weaknesses, deals 1 additional instance of True DMG for each additional Weakness.\n\n■ System\nA \"Relic Finalization Settings\" button has been added to the entry interface of \"Cavern of Corrosion\", \"Planar Ornament Extraction\", and \"Echo of War\" stages, allowing you to set which Relics will be automatically salvaged upon battle completion.\nAdds \"Smart Discard\" function for Relics: When salvaging Relics, by checking the corresponding options, the system can, based on player analytics, automatically filter and mark \"Discard\" Relics whose Main Stats don't match any recommended characters and have little hit counts on Subsidiary Stats.\nAdds \"Mass Superimposition\" feature for Light Cones: You can set different superimposition schemes to quickly superimpose 4-star Light Cones of the same name in your inventory.\n\n■ Others\nAdds new shop \"Stellar Convergence\" and exchangeable items in shop: Limited 5-star characters \"Ruan Mei (Harmony: Ice),\" \"Luocha (Abundance: Imaginary),\" standard 5-star characters, Variable Dice; Limited 5-star Light Cones \"Past Self in Mirror (Harmony),\" \"She Already Shut Her Eyes (Preservation),\" \"The Unreachable Side (Destruction),\" \"Echoes of the Coffin (Abundance),\" \"In the Night (The Hunt),\" and standard 5-star Light Cones.\nNew items \"Golden Companion Spirit\" and \"Light Cone Memory Shard\": Use 1 \"Golden Companion Spirit\" to exchange for one 5-star character in the \"Stellar Convergence\" shop; use 4 \"Light Cone Memory Shards\" to exchange for one 5-star Light Cone in the \"Stellar Convergence\" shop.\nNew item \"Silver Companion Spirit\": Every 2 \"Silver Companion Spirits\" can be exchanged for 1 \"Golden Companion Spirit.\"\nAdds new content such as \"As I've Written,\" World Shop \"Tidal Bounty,\" readable items, Messages, discs, Achievements, data bank entries, and loading screen texts. They will be gradually unlocked during your Trailblaze Progress.\nNew Limited-Time Bundles: \"Special Ticket\" and \"Trailblaze Assistance.\"\nAdds the \"Phone Case\" tab in the Phone > Phone Decoration interface. You can check and switch the phone cases used by the Trailblazer.\nAdds \"Namecard Settings\" function in the \"Trailblazer Profile.\" You can switch your \"Trailblazer Profile\" namecard and view the preview effects for namecards in the Friend List.\n\n▌ Adjustments and Optimizations\n■ Combat\nAdjusts target selection logic for certain characters during auto-battle under specific conditions.\nAdjusts the descriptive text for the \"Departed\" state.\n\n■ Missions\nAdjusts the performance of the Version 3.0 Trailblaze Mission \"Amphoreus — Heroic Saga of Flame-Chase.\" Optimizes certain mission flow, including reducing dialogues, and rendering certain dialogues and mission sequences as optional content, made specific puzzles skippable, and simplified the process of solving certain puzzles, etc.\n\n■ Events\nOptimizes the \"Aptitude Showcase\" character trial event. After the optimizations, in the Trial Stages, you can view battle summaries and ability descriptions for all characters in your set lineup. Before combat begins, you can switch characters within the team and activate their Techniques. Once combat starts, the Auto-Battle feature becomes available. Some Trial Stages require completing the tutorial phase before unlocking character switching and Auto-Battle functions.\nStarlit Homecoming Event Optimizations: Newly added Homecoming Assistance can grant a designated and owned character a set of Main Stat and Relic set appropriate 4-star Relics. A Gift for Returners now includes an additional reward of \"Fuel Voucher\" ×100. You can use Fuel Vouchers along with Trailblaze Power to Quick Farm materials from Calyx/Stagnant Shadow. When you Quick Farm, each Trailblaze Power ×10 consumed requires Fuel Voucher ×1.\n\n■ System\nCharacter Warp optimization. After the optimization, Trailblazers can select seven non-featured 5-Star characters in the Character Event Warp. The first batch of customizable non-featured 5-Star characters includes: limited 5-Star characters \"Fu Xuan (Preservation: Quantum),\" \"Blade (Destruction: Wind),\" \"Seele (The Hunt: Quantum),\" and seven standard 5-Star characters. Trailblazers can select a total of seven characters from these ten 5-Star characters to add to the list.\n5-Star Character Eidolon Overflow optimization. After optimization, when Trailblazers obtain a 5-Star character (including limited and standard) with max Eidolons, they will receive 1 additional \"Silver Companion Spirit.\" For Eidolon overflow that occurred before Version 3.2, corresponding amounts of \"Silver Companion Spirit\" will be distributed after the Version 3.2 update.\nAdds text descriptions to certain sections in the Character Event Warp \"Details\" interface. These changes do not affect the actual warp probability, which remains consistent with previous versions.\nImproves the \"Supplement Materials\" feature when consuming materials for upgrades. After optimization, when you don't have enough of the required materials but possess the corresponding amount of lower rarity or universal materials, you can directly go to the \"Material Synthesis\" button on the material consumption interface to auto-complete the materials, without having to go to the \"Synthesis\" interface.\nOptimizes the character selection Catalog display sequence for the \"Build Target\" in the Interastral Peace Guide. After the optimizations, owned \"Warp\" characters will be displayed with priority among \"My Characters.\"\n● From 2025/04/26 00:00:00 (server time), the birthday cake in the birthday mail will switch from \"Wayfare's Blessing\" to \"Golden Blessing\".\n※ The time the birthday cake switches over is not identical across all servers. Please refer to the times below:\nAsia: 2025/04/26 00:00 (server time)\nTW,HK,MO: 2025/04/26 00:00 (server time)\nAmerica: 2025/04/25 00:00 (server time)\nEurope: 2025/04/26 00:00 (server time)\n\n■ Audio\nAdjusts and optimizes some dialogue voice lines in the mission flow of Trailblaze Mission \"Amphoreus — Wasteland, Hark Back Glory of Old/Kremnos, Cleanse Thy Rusted Blood (II)/Strife, Dispel the Accompanying Fears/Glory, Turn From Imbibed Poison/Grove, Wherefore Are the Wise Silent/Nemesis, Scorched by Golden Blood\" when the voice language is set to English.\nOptimizes some Japanese character voice lines for the character Herta (Erudition: Ice).\nAdjusts and optimizes some dialogue voice lines in the mission flow of Trailblaze Mission \"Amphoreus - Distant Travelers, Listen to this World's Prayer/Kremnos, Cleanse Thy Rusted Blood/Memories, Veiled in Blazing Mist/Passages, Knocking Echoes in Dreams/Passage, Reveal the Past Once More\" when the voice language is set to Japanese.\nOptimizes certain story voice lines in the \"Demised Scholar\" story in \"As I've Written — Amphoreus' Saga of Heroes\" when the voice language is set to Japanese.\nOptimizes some Japanese environmental voice lines in the Eternal Holy City Okhema map.\nOptimizes some dialogue voice lines for NPC Aechenus and Tides of the Basin when the voice language is set to Japanese.\nAdjusts and optimizes some Korean character voice lines for the character Tribbie (Harmony: Quantum).\nAdjusts and optimizes some dialogue voice lines in the mission flow of Trailblaze Mission \"Amphoreus — Night Stars, Accompany My Slumber/Glory, Turn From Imbibed Poison/Grove, Wherefore Are the Wise Silent/Passage, Reveal the Past Once More\" when the voice language is set to Korean.\nOptimizes some Korean dialogue voice lines in the mission flow of the Companion Mission \"Swords to Plowshares.\"\nAdjusts and optimizes certain story voice lines in the \"Demised Scholar\" and \"Triplets of Fate\" story in \"As I've Written — Amphoreus' Saga of Heroes\" when the voice language is set to Korean.\n\n■ Others\nAdjusts the descriptions for completing some Achievements, which does not affect the actual requirements to complete them.\nResets the double bonus count of the first Oneiric Shard top-up for each rank in the \"Shop\" — \"Oneiric Pouch\" interface.\nAdjusts some tabs in \"Shop\": The \"Starlight Exchange\" and \"Embers Exchange\" tabs have been merged into the \"Exchange Shop\" tab.\nAdjusts the reward rank at Honor Level 10 of \"Nameless Glory\", adding 1 \"Light Cone Memory Shard.\" Adjusts the immediate rewards when unlocking the \"Nameless Medal,\" adding 1 \"Light Cone Memory Shard.\" Some original rank rewards have also been adjusted.\nAdjusts the name of \"Echo of War: Borehole Planet's Old Crater\": The stage name has been changed to \"Echo of War: Borehole Planet's Past Nightmare.\"\nAdjusts shadow effects for certain NPCs.\n\n▌ Bug Fixes\n■ Characters and Enemies\nFixes an issue where the character Mydei (Destruction: Imaginary)'s specific ability may experience abnormalities when he receives a killing blow and exits \"Vendetta\" state under certain conditions.\nFixes the issue where some Break DMG Boost effects do not work on the additional Break DMG dealt by Ruan Mei (Harmony: Ice)'s Talent and Technique under certain circumstances.\nFixes an issue where, under certain circumstances, after the character Ruan Mei (Harmony: Ice) uses her Ultimate, the ally memosprite detail menu does not display this ability's buffs. This issue does not affect the actual gameplay performance.\nFixes an issue where character lighting effects would appear abnormal after teleporting via Space Anchor under specific graphics settings.\nFixes issues for certain abnormal character, NPC, and enemy models, visual effects, and movement effects.\nFixes an issue where the \"Titanic Corpus\" effect description was incorrect for the enemy \"Savage God, Mad King, Incarnation of Strife\" and \"Savage God, Mad King, Incarnation of Strife (Complete).\" This issue did not affect its actual functionality.\nFixes an issue where some graphics are displayed abnormally when Noontide Gryphon or Moonlit Pegasus uses an ability in some circumstances.\nFixes an issue where the UI of some skills abnormally remains when the enemy \"The Giver, Master of Legions, Lance of Fury\" enters the next phase under certain circumstances.\nFixes an issue where some \"Synthesis Materials\" are dropped abnormally when the enemy Tide-Eroded Blade is defeated in some circumstances.\nFixes an issue when the enemies \"Borisin Warhead: Hoolay,\" \"Borisin Warhead: Hoolay (Complete),\" \"Sableclaw Wolftrooper,\" and \"Eclipse Wolftrooper\" are Taunted by allies, the \"Taunt\" state effect is not displayed. This issue does not affect the actual gameplay performance.\n\n■ Combat\nFixes an issue where certain visual effects and text descriptions in the Action Order would display abnormally under specific circumstances.\nFixes an issue where, under certain circumstances, the water reflection effect was missing from the ability scene after character Acheron (Nihility: Lightning) used her Ultimate.\nFixes an issue where, when battling the enemy \"The Giver, Master of Legions, Lance of Fury\", Moze (The Hunt: Lightning) was unable to restore Max HP under certain circumstances.\nFixes an issue where, in combat, some ability effects of the Light Cone \"River Flows in Spring (The Hunt)\" did not match their text descriptions. After the fix, the effects will be consistent with the text descriptions.\nFixes the issue where, after the Slow effect of the Light Cone Whereabouts Should Dreams Rest (Destruction) is triggered, there's a chance that the Slow effect will abnormally not be recognized under certain circumstances.\n\n■ Missions\nFixes an issue where certain mission storyline progressions were glitched in specific circumstances.\n\n■ Gameplay\nFixes an issue where sound effects would occasionally be missing when advancing Astronomical Division levels in \"Divergent Universe: Protean Hero.\"\nFixes an issue with incorrect text descriptions in the \"Stable Computing Array\" interface of \"Divergent Universe: Protean Hero.\" This issue does not affect the actual reward acquisition.\nFixes an issue in Simulated Universe: Protean Hero and Simulated Universe: Unknowable Domain where the DMG effects of certain ally attacks are abnormal when fighting the enemy \"Cirrus (Complete)\" under specific circumstances.\nFixes an issue where when characters are downed or a memosprite disappears, this might abnormally Charge \"Soul Chrysalis\" under certain special circumstances in Divergent Universe: Protean Hero.\n\n■ System\nFixes an issue where some text in the memosprite \"View Details\" interface would occasionally display incorrectly. This issue did not affect the actual stats of memosprites.\nFixes an issue where interface text could display abnormally when synthesizing Relics using \"Relic Remains\" under specific circumstances. This issue did not affect the actual materials consumed.\nFixes an issue where the \"Build Guide\" interface displayed abnormally under certain circumstances.\n\n■ Audio\nFixes an issue where some music and sound effects perform abnormally under specific conditions.\nFixes an issue where some voice lines were missing in the \"Weaver of Gold\" story in \"As I've Written\" — \"Amphoreus' Saga of Heroes\" when the voice language is set to Chinese.\nFixes an issue where the pronouns for the Flame Reaver were incorrect in the mission flow of Trailblaze Mission \"Amphoreus — Passages, Knocking Echoes in Dreams/Grove, Wherefore Are the Wise Silent\" when the voice language is set to English.\nFixes an issue where some dialogue voice lines were incorrect in the mission flow of Trailblaze Mission \"Amphoreus — Throne, End Those Long Years Forlorn\" when the voice language is set to Japanese.\nFixes an issue where some voice lines were incorrect in the \"Servant of Death\" story in \"As I've Written\" — \"Amphoreus' Saga of Heroes\" when the voice language is set to Japanese.\nFixes an issue where some dialogue voice lines were missing in the mission flow of Trailblaze Mission \"Amphoreus — Passage, Reveal the Past Once More\" when the voice language is set to Korean.\nFixes an issue where some dialogue voice lines were abnormal in the mission flow of Trailblaze Continuance \"The Xianzhou Luofu — At Dawn, To War\" when the voice language is set to Korean.\nFixes an issue where some voice lines were incorrect in the \"Servant of Death\" story in \"As I've Written\" — \"Amphoreus' Saga of Heroes\" when the voice language is set to Korean.\n\n■ Others\nFixed an issue where the color of certain chimera models are abnormal after the V3.1 update. The models now remain consistent with V3.0.\nFixes an issue where Trailblazers on the PC platform could not close the \"Quick Recover\" popup for replenishing Technique Points using the \"ESC\" button under certain circumstances.\nFixes an issue where there is a certain chance that the \"Cerces' Incomplete Theorem\" Achievement cannot be completed under specific circumstances.\nFixes an issue where you will be unable to obtain the completion progress for the \"Day of the Triffids (I), (II), and (III)\" Achievements after clearing certain special \"Calyx\" series stages.\nIn-game texts for 13 languages have been optimized and fixed. These changes do not affect the actual effects. Trailblazers can switch the game language through \"Phone — Settings — Language\" and view the corresponding changes in the announcement.\n\nFixes and optimizations in English include the following (they have no impact on the actual in-game effects):\nAdjusts and optimizes various text descriptions, readable items, Messages, item names, mission summaries, Navigation introductions, Status Effects, tutorials, system notifications, Titan introductions in \"Voice of Constellation,\" and gameplay text and text descriptions, etc.\nFixes errors in some of the text pertaining to the character Trailblazer's introduction.\nOptimizes some descriptions related to \"Follow-up ATK\".\n\n",
    "startDate": "2025-04-09T11:00:00",
    "endDate": "2025-05-20T03:59:00",
    "startTimestamp": 1744192800000,
    "endTimestamp": 1747709940000,
    "lastUpdated": "2025-04-24T20:39:35.522898",
    "sentiment": "neutral",
    "version": "3.2",
    "imageUrl": "/assets/images/events/event_38119901.png"
  },
  {
    "eventId": "38107267",
    "title": "Version 3.2 Event Warp: Part I",
    "description": "Hello, Trailblazers! The Event Warp period for this phase is from after the Version 3.2 update – 2025/04/30 11:59:00 (server time), and includes the following content: ※ Among the above characters and Light Cones, limited characters and limited Light Cones will not be available in the Stellar Warp event. ※ In this phase of Warp, obtainable 5-star characters include the featured 5-star characters and the custom-selected characters from \"Celestial Invitation.\" ※ During the Event Warp period, the limited 5-star character \"Castorice (Remembrance: Quantum)\" can only be obtained from the \"Blossom to the Beyond\" Character Event Warp, while the limited 5-star characters \"Fugue (Nihility: Fire),\" \"Jiaoqiu (Nihility: Fire),\" and \"Acheron (Nihility: Lightning)\" can only be obtained from their corresponding \"Indelible Coterie\" Character Event Warps. ※ During the Event Warp period, the limited 5-star Light Cone \"Make Farewells More Beautiful (Remembrance)\" can only be obtained from the \"Brilliant Fixation: Make Farewells More Beautiful\" Light Cone Event Warp, and the limited 5-star Light Cones \"Long Road Leads Home (Nihility),\" \"Those Many Springs (Nihility),\" and \"Along the Passing Shore (Nihility)\" can only be obtained from their corresponding \"Coalesced Truths\" Light Cone Event Warp. ※ \"Blossom to the Beyond\" and \"Indelible Coterie\" are Character Event Warps that share the same guaranteed drop counter. The cumulative Warp count for a guaranteed 5-star character in any Character Event Warp will always be carried over to other Character Event Warps, but is independent of and unaffected by other types of Warps. ※ \"Brilliant Fixation\" and \"Coalesced Truths\" are considered Light Cone Event Warps, and share the same guaranteed drop counter. The cumulative Warp count for a guaranteed 5-star Light Cone in any Light Cone Event Warp will always be carried over to other Light Cone Event Warps, but is independent of and unaffected by other types of Warps. ※ The \"Indelible Coterie\" Character Event Warp and the \"Coalesced Truths\" Light Cone Event Warp will irregularly become available in future version updates. For more details, please stay tuned for official announcements. ※ For more information, please head to the Warp screen. ▌ Character Trial Event: Aptitude Showcase ● Requirements: Unlock Travel Log ● Event Period: After the Version 3.2 update until 2025/04/30 11:59:00 (server time) ● Event Content: Try out trial characters \"Castorice (Remembrance: Quantum),\" \"Fugue (Nihility: Fire),\" \"Jiaoqiu (Nihility: Fire),\" \"Acheron (Nihility: Lightning),\" \"Pela (Nihility: Ice),\" \"Gallagher (Abundance: Fire),\" and \"Lynx (Abundance: Quantum)\" in their trial stages. Complete challenges to earn rewards including Stellar Jade, Adventure Log, Universal Enhancement Materials, and credits. ▌ Celestial Invitation Custom Characters Trailblazers can customize 7 \"Celestial Invitation\" characters in the Character Event Warp. ● Fu Xuan (Preservation: Quantum) ● Blade (Destruction: Wind) ● Seele (The Hunt: Quantum) ● Himeko (Erudition: Fire) ● Welt (Nihility: Imaginary) ● Bronya (Harmony: Wind) ● Gepard (Preservation: Ice) ● Clara (Destruction: Physical) ● Yanqing (The Hunt: Ice) ● Bailu (Abundance: Lightning) ※ The first time you obtain a 5-star character in this Warp event, there is a 50% chance that it will be the featured 5-star character. There is also a 50% chance that it will be one of the obtainable 5-star characters in this Warp phase, with equal chance among them. ※ If the Celestial Invitation characters include this phase's featured 5-star character, when you fail to trigger the 50% chance to immediately obtain the featured 5-star character, you will obtain 1 character from the featured character and 7 Celestial Invitation characters. The Celestial Invitation characters each have a consistent 12.5% drop rate while the featured character is at 25%. ※ Regardless of whether you trigger the featured guarantee, it will be reset when you obtain the featured character. ▌ Special Notes on 5-Star Character Eidolon Overflow Optimization ● Starting from Version 3.2, when Trailblazers obtain a 5-star character's Eidolon (including both limited and standard characters) that has already reached max Eidolons, they will receive Silver Companion Spirit ×1. ● Surplus Eidolons obtained before Version 3.2 will be compensated with the corresponding amount of \"Silver Companion Spirit\" after the Version 3.2 update. ● The optimization for 5-star character Eidolon surplus applies to all sources and methods of obtaining 5-star characters.\n▌ Event Details\n\n※ Among the above characters and Light Cones, limited characters and limited Light Cones will not be available in the Stellar Warp event.\n※ In this phase of Warp, obtainable 5-star characters include the featured 5-star characters and the custom-selected characters from \"Celestial Invitation.\"\n※ During the Event Warp period, the limited 5-star character \"Castorice (Remembrance: Quantum)\" can only be obtained from the \"Blossom to the Beyond\" Character Event Warp, while the limited 5-star characters \"Fugue (Nihility: Fire),\" \"Jiaoqiu (Nihility: Fire),\" and \"Acheron (Nihility: Lightning)\" can only be obtained from their corresponding \"Indelible Coterie\" Character Event Warps.\n※ During the Event Warp period, the limited 5-star Light Cone \"Make Farewells More Beautiful (Remembrance)\" can only be obtained from the \"Brilliant Fixation: Make Farewells More Beautiful\" Light Cone Event Warp, and the limited 5-star Light Cones \"Long Road Leads Home (Nihility),\" \"Those Many Springs (Nihility),\" and \"Along the Passing Shore (Nihility)\" can only be obtained from their corresponding \"Coalesced Truths\" Light Cone Event Warp.\n※ \"Blossom to the Beyond\" and \"Indelible Coterie\" are Character Event Warps that share the same guaranteed drop counter. The cumulative Warp count for a guaranteed 5-star character in any Character Event Warp will always be carried over to other Character Event Warps, but is independent of and unaffected by other types of Warps.\n※ \"Brilliant Fixation\" and \"Coalesced Truths\" are considered Light Cone Event Warps, and share the same guaranteed drop counter. The cumulative Warp count for a guaranteed 5-star Light Cone in any Light Cone Event Warp will always be carried over to other Light Cone Event Warps, but is independent of and unaffected by other types of Warps.\n※ The \"Indelible Coterie\" Character Event Warp and the \"Coalesced Truths\" Light Cone Event Warp will irregularly become available in future version updates. For more details, please stay tuned for official announcements.\n※ For more information, please head to the Warp screen.\n\n▌ Character Trial Event: Aptitude Showcase\n● Requirements: Unlock Travel Log\n● Event Period: After the Version 3.2 update until 2025/04/30 11:59:00 (server time)\n● Event Content: Try out trial characters \"Castorice (Remembrance: Quantum),\" \"Fugue (Nihility: Fire),\" \"Jiaoqiu (Nihility: Fire),\" \"Acheron (Nihility: Lightning),\" \"Pela (Nihility: Ice),\" \"Gallagher (Abundance: Fire),\" and \"Lynx (Abundance: Quantum)\" in their trial stages. Complete challenges to earn rewards including Stellar Jade, Adventure Log, Universal Enhancement Materials, and credits.\n\n▌ Celestial Invitation Custom Characters\nTrailblazers can customize 7 \"Celestial Invitation\" characters in the Character Event Warp.\n● Fu Xuan (Preservation: Quantum)\n● Blade (Destruction: Wind)\n● Seele (The Hunt: Quantum)\n● Himeko (Erudition: Fire)\n● Welt (Nihility: Imaginary)\n● Bronya (Harmony: Wind)\n● Gepard (Preservation: Ice)\n● Clara (Destruction: Physical)\n● Yanqing (The Hunt: Ice)\n● Bailu (Abundance: Lightning)\n※ The first time you obtain a 5-star character in this Warp event, there is a 50% chance that it will be the featured 5-star character. There is also a 50% chance that it will be one of the obtainable 5-star characters in this Warp phase, with equal chance among them.\n※ If the Celestial Invitation characters include this phase's featured 5-star character, when you fail to trigger the 50% chance to immediately obtain the featured 5-star character, you will obtain 1 character from the featured character and 7 Celestial Invitation characters. The Celestial Invitation characters each have a consistent 12.5% drop rate while the featured character is at 25%.\n※ Regardless of whether you trigger the featured guarantee, it will be reset when you obtain the featured character.\n\n▌ Special Notes on 5-Star Character Eidolon Overflow Optimization\n● Starting from Version 3.2, when Trailblazers obtain a 5-star character's Eidolon (including both limited and standard characters) that has already reached max Eidolons, they will receive Silver Companion Spirit ×1.\n● Surplus Eidolons obtained before Version 3.2 will be compensated with the corresponding amount of \"Silver Companion Spirit\" after the Version 3.2 update.\n● The optimization for 5-star character Eidolon surplus applies to all sources and methods of obtaining 5-star characters.\n\n\n",
    "startDate": "2025-04-09T11:00:00",
    "endDate": "2025-04-30T11:59:00",
    "startTimestamp": 1744192800000,
    "endTimestamp": 1746010740000,
    "lastUpdated": "2025-04-24T20:39:37.768305",
    "sentiment": "negative",
    "version": "3.2",
    "imageUrl": "/assets/images/events/event_38107267.png"
  },
  {
    "eventId": "38073215",
    "title": "Version 3.2 Store & Nameless Honor Update",
    "description": "Hello, Trailblazers! After the Version 3.2 update, Nameless Honor and the store will be updated, with details as follows. ▌ Version 3.2 Nameless Honor Details During the event, Trailblazers can increase their Nameless Honor level to obtain rewards such as Star Rail Passes, Wishful Resin, Self-Modeling Resins, and Tracks of Destiny. After unlocking \"Nameless Glory\", you will immediately obtain Stellar Jade ×680. By increasing Nameless Honor levels, you can additionally receive rewards such as Light Cone Memory Shard ×1, Star Rail Special Pass ×4, a selected 4-star Light Cone, Variable Dice ×1, Wishful Resin ×1, Self-Modeling Resin ×1, Relic Remains, universal Path material \"Tears of Dreams\", and more! If the Trailblazer unlocks the Nameless Medal, in addition to the previous rewards, they will immediately increase their Honor level by 10, and obtain the avatars \"Castorice: Ingenuity,\" \"Anaxa: Ingenuity,\" Light Cone Memory Shard ×1, Stellar Jade ×200, and Fuel rewards! ■ Opening Time After the Version 3.2 update — 2025/05/19 03:59:00 (server time) ■ Requirements Trailblaze Level ≥ 12 and have completed the Trailblaze Mission \"Jarilo-VI — Long Wait for the Blade's Edge\" ■ Nameless Honor Details ● After Nameless Honor is unlocked, the Nameless Gift will automatically be unlocked. Trailblazers can obtain EXP and increase their Nameless Honor level via This Week's Missions and This Period's Missions. The maximum Nameless Honor level is capped at Level 70. Attaining specific levels will allow the Trailblazer to obtain Star Rail Passes, Self-Modeling Resin, Tracks of Destiny, and more. ● This Week's Missions will reset every Monday at 04:00 (server time). ● Trailblazers who have unlocked the Nameless Glory can purchase Honor Badge to upgrade to Nameless Medal. ■ Reminders ● After reaching level cap, EXP will no longer be awarded through missions during this period. ● In the event of special circumstances leading to the repeated purchase of Nameless Glory or Nameless Medal, The Nameless EXP will not be accumulated, and Oneiric Shards ×750 (or Oneiric Shards ×1,410) will be refunded depending on the price of the purchase. ● In the event of special circumstances leading to the repeated purchase of the Honor Badge, Oneiric Shards ×860 will be refunded. ● The purchase of Nameless Glory, Nameless Medal, and Honor Badge will be closed for this period at 2025/05/19 02:59:00 (server time). After the purchase is closed, Trailblazers can still complete the Nameless Honor missions and receive rewards. Please note the available purchase time and event period. ● In the webpage top-up center, the purchase deadline for Nameless Glory, Nameless Medal, and Honor Badge is 2025/05/18 03:59:00 (UTC+8). Trailblazers who top up via webpage should note the available purchase time. ▌ New at Stellar Convergence Store ■ New Arrival Time After the Version 3.2 update ■ Character Exchange ● Limited 5-star characters: Ruan Mei (Harmony: Ice), Luocha (Abundance: Imaginary) ● Standard 5-star characters: Himeko (Erudition: Fire), Welt (Nihility: Imaginary), Bronya (Harmony: Wind), Gepard (Preservation: Ice), Clara (Destruction: Physical), Yanqing (The Hunt: Ice), and Bailu (Abundance: Lightning). ● Variable Dice ※ Exchangeable by using Golden Companion Spirits. ■ Light Cone Exchange ● Limited 5-star Light Cones: \"Past Self in Mirror (Harmony),\" \"She Already Shut Her Eyes (Preservation),\" \"The Unreachable Side (Destruction),\" \"Echoes of the Coffin (Abundance),\" \"In the Night (The Hunt)\" ● Standard 5-star Light Cones: \"Night on the Milky Way (Erudition),\" \"In the Name of the World (Nihility),\" \"But the Battle Isn't Over (Harmony),\" \"Something Irreplaceable (Destruction),\" \"Moment of Victory (Preservation),\" \"Sleep Like the Dead (The Hunt),\" \"Time Waits for No One (Abundance)\" ※ Exchangeable by using Light Cone Memory Shards. ※ More characters/Light Cones will be added to the store for exchange later. ▌ New at Herta's Store ■ New Arrival Time After the Version 3.2 update ■ New Content 4-star Light Cone \"Ninja Record: Sound Hunt (Destruction)\" Light Cone Superimposition Material \"Music Disc\"\n▌ Event Details\nHello, Trailblazers!\nAfter the Version 3.2 update, Nameless Honor and the store will be updated, with details as follows.\n\n▌ Version 3.2 Nameless Honor Details\nDuring the event, Trailblazers can increase their Nameless Honor level to obtain rewards such as Star Rail Passes, Wishful Resin, Self-Modeling Resins, and Tracks of Destiny.\nAfter unlocking \"Nameless Glory\", you will immediately obtain Stellar Jade ×680. By increasing Nameless Honor levels, you can additionally receive rewards such as Light Cone Memory Shard ×1, Star Rail Special Pass ×4, a selected 4-star Light Cone, Variable Dice ×1, Wishful Resin ×1, Self-Modeling Resin ×1, Relic Remains, universal Path material \"Tears of Dreams\", and more!\nIf the Trailblazer unlocks the Nameless Medal, in addition to the previous rewards, they will immediately increase their Honor level by 10, and obtain the avatars \"Castorice: Ingenuity,\" \"Anaxa: Ingenuity,\" Light Cone Memory Shard ×1, Stellar Jade ×200, and Fuel rewards!\n\n■ Opening Time\nAfter the Version 3.2 update — 2025/05/19 03:59:00 (server time)\n\n■ Requirements\nTrailblaze Level ≥ 12 and have completed the Trailblaze Mission \"Jarilo-VI — Long Wait for the Blade's Edge\"\n\n■ Nameless Honor Details\n● After Nameless Honor is unlocked, the Nameless Gift will automatically be unlocked. Trailblazers can obtain EXP and increase their Nameless Honor level via This Week's Missions and This Period's Missions. The maximum Nameless Honor level is capped at Level 70. Attaining specific levels will allow the Trailblazer to obtain Star Rail Passes, Self-Modeling Resin, Tracks of Destiny, and more.\n● This Week's Missions will reset every Monday at 04:00 (server time).\n● Trailblazers who have unlocked the Nameless Glory can purchase Honor Badge to upgrade to Nameless Medal.\n\n■ Reminders\n● After reaching level cap, EXP will no longer be awarded through missions during this period.\n● In the event of special circumstances leading to the repeated purchase of Nameless Glory or Nameless Medal, The Nameless EXP will not be accumulated, and Oneiric Shards ×750 (or Oneiric Shards ×1,410) will be refunded depending on the price of the purchase.\n● In the event of special circumstances leading to the repeated purchase of the Honor Badge, Oneiric Shards ×860 will be refunded.\n● The purchase of Nameless Glory, Nameless Medal, and Honor Badge will be closed for this period at 2025/05/19 02:59:00 (server time). After the purchase is closed, Trailblazers can still complete the Nameless Honor missions and receive rewards. Please note the available purchase time and event period.\n● In the webpage top-up center, the purchase deadline for Nameless Glory, Nameless Medal, and Honor Badge is 2025/05/18 03:59:00 (UTC+8). Trailblazers who top up via webpage should note the available purchase time.\n\n▌ New at Stellar Convergence Store\n■ New Arrival Time\nAfter the Version 3.2 update\n\n■ Character Exchange\n● Limited 5-star characters: Ruan Mei (Harmony: Ice), Luocha (Abundance: Imaginary)\n● Standard 5-star characters: Himeko (Erudition: Fire), Welt (Nihility: Imaginary), Bronya (Harmony: Wind), Gepard (Preservation: Ice), Clara (Destruction: Physical), Yanqing (The Hunt: Ice), and Bailu (Abundance: Lightning).\n● Variable Dice\n※ Exchangeable by using Golden Companion Spirits.\n\n■ Light Cone Exchange\n● Limited 5-star Light Cones: \"Past Self in Mirror (Harmony),\" \"She Already Shut Her Eyes (Preservation),\" \"The Unreachable Side (Destruction),\" \"Echoes of the Coffin (Abundance),\" \"In the Night (The Hunt)\"\n● Standard 5-star Light Cones: \"Night on the Milky Way (Erudition),\" \"In the Name of the World (Nihility),\" \"But the Battle Isn't Over (Harmony),\" \"Something Irreplaceable (Destruction),\" \"Moment of Victory (Preservation),\" \"Sleep Like the Dead (The Hunt),\" \"Time Waits for No One (Abundance)\"\n※ Exchangeable by using Light Cone Memory Shards.\n※ More characters/Light Cones will be added to the store for exchange later.\n\n▌ New at Herta's Store\n■ New Arrival Time\nAfter the Version 3.2 update\n\n■ New Content\n4-star Light Cone \"Ninja Record: Sound Hunt (Destruction)\"\nLight Cone Superimposition Material \"Music Disc\"\n",
    "startDate": "2025-04-09T11:00:00",
    "endDate": "2025-05-19T03:59:00",
    "startTimestamp": 1744192800000,
    "endTimestamp": 1747623540000,
    "lastUpdated": "2025-04-24T20:39:43.687818",
    "sentiment": "neutral",
    "version": "3.2",
    "imageUrl": "/assets/images/events/event_38073215.png"
  },
  {
    "eventId": "38056278",
    "title": "\"To The Ones That Blaze\": Obtain Stellar Jade ×1,600 & Fuel ×10",
    "description": "To the ones that blaze, may the star rail guide you, and may the universe sing with you. ▌ Event Period After Version 3.2 Update — 2025/05/21 06:00:00 (UTC+8) ▌Participation Requirement Unlock Travel Log ▌ Event Rewards ▌ Event Details ● During the period from after Version 3.2 update until 2025/04/26 12:00:00 (UTC+8), Trailblazers can select a character as their invitation recipient to receive a letter and gifts from them in the \"To The Ones That Blaze\" event page. During this period, you can modify your chosen character, but after this time, no selection or modification will be possible. ● From 2025/04/26 12:00:00 to 2025/05/21 06:00:00 (UTC+8), on the \"To The Ones That Blaze\" event page, Trailblazers will receive a letter from their invited character with Stellar Jade ×1,600 and Fuel ×10 as rewards. ● If you haven't invited a character before 2025/04/26 12:00:00 (UTC+8), you will receive a letter from a random invitable character. ● After the event ends, you can no longer receive the letter from the character or collect rewards.",
    "startDate": "2025-04-26T12:00:00",
    "endDate": "2025-05-21T06:00:00",
    "startTimestamp": 1745665200000,
    "endTimestamp": 1747803600000,
    "lastUpdated": "2025-04-24T20:39:50.081193",
    "sentiment": "neutral",
    "sectionImages": {
      "Event Rewards": "/assets/images/events/sections/event_38056278_event_rewards.png"
    },
    "imageUrl": "/assets/images/events/event_38056278.jpg"
  },
  {
    "eventId": "37896318",
    "title": "Anniversary Special Content Details",
    "description": "Hello, Trailblazers! After the Version 3.2 update, the First Purchase Double Bonus will be reset, and you can unlock more rewards by accumulating Oneiric Shards! Additionally, Value Packs will be available for a limited time! ▌ Version 3.2 \"First-Time Top-up Bonus Refreshed\" Notice After the Version 3.2 update, the shop's Oneiric Pouch interface will reset the first-time top-up. All Oneiric Shard bundles will reset their first top-up bonus state. ■ Reset Time After the Version 3.2 update ■ Reset Details ● After the reset, all bundles will have their first top-up bonus refreshed. ● When a bundle that the player has not purchased before is reset, the previous first top-up bonus will not be retained, and the bonus will not be triggered twice after the reset. ● Products purchased through external payment methods (such as the web top-up center) will be obtained after the Trailblazer completes the purchase and logs in to the game. If Trailblazers wish to use the First-Time Top-up Bonus from before Version 3.2, please log in to the game before 2025/04/09 06:00:00 (UTC+8), otherwise it will consume the bonus after reset. ▌ Limited-Time Pack \"Special Ticket\" Purchase this pack to get Star Rail Special Pass ×1, Star Rail Pass ×1, and credit ×30,000! ■ Release Time After the Version 3.2 update — 2025/05/20 14:59:00 (server time) ■ Package Details ● Purchase to get Star Rail Special Pass ×1, Star Rail Pass ×1, and credit ×30,000! ● During the sale period, this pack can only be purchased once. In case of accidental duplicate purchases, Oneiric Shard ×60 will be directly refunded. ● Trailblazers who purchase the pack through external channels (such as the web top-up center) should log in to the game promptly after purchase to claim their rewards. If you log in after the pack is no longer available, you will receive Oneiric Shard ×60 directly instead. ▌ Limited-Time Pack \"Trailblaze Assistance\" Log in daily to gain rewards! Log in for 5 days to receive a total of Oneiric Shard ×320, Star Rail Special Pass ×4, and Fuel ×10! ■ Release Time After the Version 3.2 update — 2025/05/20 14:59:00 (server time) ■ Package Details ● Purchase to immediately gain the first-day reward of Oneiric Shard ×320 and Fuel ×2. ● Starting from the next day, log in daily to unlock Star Rail Special Pass ×1 and Fuel ×2 as rewards, for a total of 4 sets. ● From the day of purchase, Trailblazers can log in daily within 10 days to unlock the corresponding rewards. One reward can be unlocked per day, and any unclaimed rewards will be forfeited. ● The Oneiric Shards obtained from purchasing the pack will count towards the \"Cherished Recollection\" event. ● During the sale period, this pack can only be purchased once. If duplicate purchases occur due to special circumstances, Oneiric Shard ×330 will be refunded directly. ● Trailblazers who purchase the pack through external channels (such as the web top-up center) should log in to the game promptly after purchase to claim their rewards. If you log in after the pack is no longer available, you will receive Oneiric Shard ×330 directly instead. ▌ Notes on Limited-Time Bundles: \"Special Ticket\" and \"Trailblaze Assistance\" ● For the \"Special Ticket\" and \"Trailblaze Assistance\" packs, Trailblazers should refer to the actual prices displayed in the store after the packs are listed. ● In the Web Top-up Center, the purchase period for the \"Special Ticket\" and \"Trailblaze Assistance\" bundles will end at 2025/05/19 14:59:00 (UTC+8). Trailblazers using web top-up should take note of the available purchase time. ▌ Version 3.2 Oneiric Shard Collection Event \"Cherished Recollection\" Details Version 3.2 will feature the \"Cherished Recollection\" event. Collect Oneiric Shards to unlock corresponding rewards. ■ Event Period After the Version 3.2 update — 2025/05/20 14:59:00 (server time) ■ Event Rewards During the event period, accumulate Oneiric Shards and unlock rewards at corresponding ranks. ● Collect Oneiric Shard ×300: Tears of Dreams ×150 ● Collect Oneiric Shard ×2,000: Self-Modeling Resin ×2 ● Collect Oneiric Shard ×4,000: Wishful Resin ×4 ● Collect Oneiric Shard ×8,000: Light Cone Memory Shard ×4 (used for exchanging 5-star Light Cones in Stellar Convergence shop) ● Collect Oneiric Shard ×12,000: Variable Dice ×2 ● Collect Oneiric Shard ×18,000: Golden Companion Spirit ×1 (used for exchanging 5-star characters in Stellar Convergence shop) ● Collect Oneiric Shard ×25,000: Exclusive Personal Display Set ×1 (includes Trailblazer Phone Case \"Fun Times\", Phone Wallpaper \"Next To You\", and Name Card \"Travel Invitation\") ■ Special Notes ● Oneiric Shards obtained through direct purchase, gift packs, purchasing \"Express Supply Pass\", or refunds from duplicate gift pack purchases in special circumstances will all count towards event progress. ● When Trailblazers directly purchase Oneiric Shards, both the first-purchase double bonus and additional bonus will count towards event progress. ● Products that do not contain Oneiric Shard will not count towards event progress (e.g., unlocking \"Nameless Glory\"). ● Oneiric Shards obtained through external means (such as web top-up centers) will be counted towards event progress after the Trailblazer logs in to the game and receives the items. Please make sure to log in during the event period to avoid losing event progress. ● If Event Rewards are obtained through irregular means, the Express Crew will hold the authority to take measures such as deducting the Event Rewards. ▌ Version 3.2 Contract Shop Update ■ Release Time After the Version 3.2 update — 2025/05/20 14:59:00 (server time) ■ The Herta Contract: Strategic Support Contract Content: Self select item combo bundle. The Trailblazer can pick any two of the following items (One item may be chosen multiple times): Wishful Resin ×1, Self-Modeling Resin ×1, Relic Remains ×800, Tears of Dreams ×240, Traveler's Guide ×100, Refined Aether ×80, Lost Crystal ×120 Price: Oneiric Shard ×720. A maximum of 5 can be purchased per account while the item is available. ■ The Herta Contract: Strategic Cooperation Contract Content: Selectable item combo bundle. The Trailblazer will obtain Star Rail Special Pass ×10 and can pick any three of the following items (One item may be chosen multiple times): Wishful Resin ×2, Self-Modeling Resin ×2, Relic Remains ×1,600, Tears of Dreams ×480, Lost Crystal ×240 Price: Oneiric Shard ×2,680. A maximum of 2 can be purchased per account while the item is available. ■ Herta Contract: Roaming Refill Content: Traveler's Guide ×20, Refined Aether ×15, and credit ×60,000 Price: Oneiric Shard ×330. A maximum of 8 can be purchased per account while the item is available. ■ Herta Contract: Resource Supply V2 Content: Universal Path material Tears of Dreams ×150 and credit ×60,000 Price: Oneiric Shard ×660. A maximum of 5 can be purchased per account while the item is available.\n▌ Event Details\nHello, Trailblazers!\nAfter the Version 3.2 update, the First Purchase Double Bonus will be reset, and you can unlock more rewards by accumulating Oneiric Shards! Additionally, Value Packs will be available for a limited time!\n\n▌ Version 3.2 \"First-Time Top-up Bonus Refreshed\" Notice\nAfter the Version 3.2 update, the shop's Oneiric Pouch interface will reset the first-time top-up. All Oneiric Shard bundles will reset their first top-up bonus state.\n■ Reset Time\nAfter the Version 3.2 update\n\n■ Reset Details\n● After the reset, all bundles will have their first top-up bonus refreshed.\n● When a bundle that the player has not purchased before is reset, the previous first top-up bonus will not be retained, and the bonus will not be triggered twice after the reset.\n● Products purchased through external payment methods (such as the web top-up center) will be obtained after the Trailblazer completes the purchase and logs in to the game. If Trailblazers wish to use the First-Time Top-up Bonus from before Version 3.2, please log in to the game before 2025/04/09 06:00:00 (UTC+8), otherwise it will consume the bonus after reset.\n\n▌ Limited-Time Pack \"Special Ticket\"\nPurchase this pack to get Star Rail Special Pass ×1, Star Rail Pass ×1, and credit ×30,000!\n\n■ Release Time\nAfter the Version 3.2 update — 2025/05/20 14:59:00 (server time)\n\n■ Package Details\n● Purchase to get Star Rail Special Pass ×1, Star Rail Pass ×1, and credit ×30,000!\n● During the sale period, this pack can only be purchased once. In case of accidental duplicate purchases, Oneiric Shard ×60 will be directly refunded.\n● Trailblazers who purchase the pack through external channels (such as the web top-up center) should log in to the game promptly after purchase to claim their rewards. If you log in after the pack is no longer available, you will receive Oneiric Shard ×60 directly instead.\n\n▌ Limited-Time Pack \"Trailblaze Assistance\"\nLog in daily to gain rewards! Log in for 5 days to receive a total of Oneiric Shard ×320, Star Rail Special Pass ×4, and Fuel ×10!\n\n■ Release Time\nAfter the Version 3.2 update — 2025/05/20 14:59:00 (server time)\n\n■ Package Details\n● Purchase to immediately gain the first-day reward of Oneiric Shard ×320 and Fuel ×2.\n● Starting from the next day, log in daily to unlock Star Rail Special Pass ×1 and Fuel ×2 as rewards, for a total of 4 sets.\n● From the day of purchase, Trailblazers can log in daily within 10 days to unlock the corresponding rewards. One reward can be unlocked per day, and any unclaimed rewards will be forfeited.\n● The Oneiric Shards obtained from purchasing the pack will count towards the \"Cherished Recollection\" event.\n● During the sale period, this pack can only be purchased once. If duplicate purchases occur due to special circumstances, Oneiric Shard ×330 will be refunded directly.\n● Trailblazers who purchase the pack through external channels (such as the web top-up center) should log in to the game promptly after purchase to claim their rewards. If you log in after the pack is no longer available, you will receive Oneiric Shard ×330 directly instead.\n\n▌ Notes on Limited-Time Bundles: \"Special Ticket\" and \"Trailblaze Assistance\"\n● For the \"Special Ticket\" and \"Trailblaze Assistance\" packs, Trailblazers should refer to the actual prices displayed in the store after the packs are listed.\n● In the Web Top-up Center, the purchase period for the \"Special Ticket\" and \"Trailblaze Assistance\" bundles will end at 2025/05/19 14:59:00 (UTC+8). Trailblazers using web top-up should take note of the available purchase time.\n\n▌ Version 3.2 Oneiric Shard Collection Event \"Cherished Recollection\" Details\nVersion 3.2 will feature the \"Cherished Recollection\" event. Collect Oneiric Shards to unlock corresponding rewards.\n\n\n■ Event Period\nAfter the Version 3.2 update — 2025/05/20 14:59:00 (server time)\n\n■ Event Rewards\nDuring the event period, accumulate Oneiric Shards and unlock rewards at corresponding ranks.\n● Collect Oneiric Shard ×300: Tears of Dreams ×150\n● Collect Oneiric Shard ×2,000: Self-Modeling Resin ×2\n● Collect Oneiric Shard ×4,000: Wishful Resin ×4\n● Collect Oneiric Shard ×8,000: Light Cone Memory Shard ×4 (used for exchanging 5-star Light Cones in Stellar Convergence shop)\n● Collect Oneiric Shard ×12,000: Variable Dice ×2\n● Collect Oneiric Shard ×18,000: Golden Companion Spirit ×1 (used for exchanging 5-star characters in Stellar Convergence shop)\n● Collect Oneiric Shard ×25,000: Exclusive Personal Display Set ×1 (includes Trailblazer Phone Case \"Fun Times\", Phone Wallpaper \"Next To You\", and Name Card \"Travel Invitation\")\n\n■ Special Notes\n● Oneiric Shards obtained through direct purchase, gift packs, purchasing \"Express Supply Pass\", or refunds from duplicate gift pack purchases in special circumstances will all count towards event progress.\n● When Trailblazers directly purchase Oneiric Shards, both the first-purchase double bonus and additional bonus will count towards event progress.\n● Products that do not contain Oneiric Shard will not count towards event progress (e.g., unlocking \"Nameless Glory\").\n● Oneiric Shards obtained through external means (such as web top-up centers) will be counted towards event progress after the Trailblazer logs in to the game and receives the items. Please make sure to log in during the event period to avoid losing event progress.\n● If Event Rewards are obtained through irregular means, the Express Crew will hold the authority to take measures such as deducting the Event Rewards.\n\n▌ Version 3.2 Contract Shop Update\n■ Release Time\nAfter the Version 3.2 update — 2025/05/20 14:59:00 (server time)\n\n■ The Herta Contract: Strategic Support\nContract Content: Self select item combo bundle. The Trailblazer can pick any two of the following items (One item may be chosen multiple times):\nWishful Resin ×1, Self-Modeling Resin ×1, Relic Remains ×800, Tears of Dreams ×240, Traveler's Guide ×100, Refined Aether ×80, Lost Crystal ×120\nPrice: Oneiric Shard ×720. A maximum of 5 can be purchased per account while the item is available.\n\n■ The Herta Contract: Strategic Cooperation\nContract Content: Selectable item combo bundle. The Trailblazer will obtain Star Rail Special Pass ×10 and can pick any three of the following items (One item may be chosen multiple times):\nWishful Resin ×2, Self-Modeling Resin ×2, Relic Remains ×1,600, Tears of Dreams ×480, Lost Crystal ×240\nPrice: Oneiric Shard ×2,680. A maximum of 2 can be purchased per account while the item is available.\n\n■ Herta Contract: Roaming Refill\nContent: Traveler's Guide ×20, Refined Aether ×15, and credit ×60,000\nPrice: Oneiric Shard ×330. A maximum of 8 can be purchased per account while the item is available.\n\n■ Herta Contract: Resource Supply V2\nContent: Universal Path material Tears of Dreams ×150 and credit ×60,000\nPrice: Oneiric Shard ×660. A maximum of 5 can be purchased per account while the item is available.\n",
    "startDate": "2025-04-09T11:00:00",
    "endDate": "2025-05-20T14:59:00",
    "startTimestamp": 1744192800000,
    "endTimestamp": 1747749540000,
    "lastUpdated": "2025-04-24T20:40:05.037814",
    "sentiment": "positive",
    "version": "3.2",
    "imageUrl": "/assets/images/events/event_37896318.jpg"
  },
  {
    "eventId": "37871013",
    "title": "Realm of the Strange Event: Cavern Relic Drop Rate Doubled For a Limited Time",
    "description": "Hello, Trailblazers! ▌ Event Period 2025/03/28 04:00:00 - 2025/04/04 03:59:00 (server time) ▌Participation Requirement Unlock Cavern of Corrosion: Path of Drifting ▌ Event Details ● During the Realm of the Strange event, get double rewards when you challenge and beat Cavern of Corrosion. ● You will get an additional set of rewards on top of default drops after consuming an event double reward opportunity and Trailblaze Power. ● During the event, the number of daily double reward opportunities is limited. The maximum and currently remaining numbers of opportunities will be displayed in the Realm of the Strange event page. ● Double reward opportunities refresh daily at 04:00. Make sure to use them before they're gone!",
    "startDate": "2025-03-28T04:00:00",
    "endDate": "2025-04-04T03:59:00",
    "startTimestamp": 1743134400000,
    "endTimestamp": 1743735540000,
    "lastUpdated": "2025-04-24T20:40:13.561422",
    "sentiment": "negative",
    "imageUrl": "/assets/images/events/event_37871013.png"
  },
  {
    "eventId": "37702787",
    "title": "Version 3.1 Event Warp (II)",
    "description": "Hello, Trailblazers! Light Cone Event Warp Period for this phase is 2025/03/19 12:00:00 - 2025/04/08 15:00:00 (server time), and includes the following content: ※ Among the above characters and Light Cones, limited characters and limited Light Cones will not be available in the Stellar Warp event. ※ During the event, the limited 5-star character Mydei (Destruction: Imaginary) can only be obtained from the Character Event Warp \"Fiery Lionheart,\" and the limited 5-star character Huohuo (Abundance: Wind) can only be obtained from the Character Event Warp \"Bloom in Gloom.\" ※ During the event, the limited 5-star Light Cone \"Flame of Blood, Blaze My Path (Destruction)\" can only be obtained from the Light Cone Event Warp \"Brilliant Fixation : Flame of Blood, Blaze My Path\", and the limited 5-star Light Cone \"Night of Fright (Abundance)\" can only be obtained from the Light Cone Event Warp \"Bygone Reminiscence: Night of Fright.\" ※ \"Fiery Lionheart\" and \"Bloom in Gloom\" are considered Character Event Warps. The cumulative Warp count for a guaranteed 5-star character in any Character Event Warp will always be carried over to other Character Event Warps, but is independent of and unaffected by other types of Warps. ※ \"Brilliant Fixation: Flame of Blood, Blaze My Path\" and \"Bygone Reminiscence: Night of Fright\" are considered Light Cone Event Warps. The cumulative Warp count for a guaranteed 5-star Light Cone in any Light Cone Event Warp will always be carried over to other Light Cone Event Warps, but is independent of and unaffected by other types of Warps. ※ For more information, please head to the Warp screen. ▌ Character Trial Event: Aptitude Showcase ● Requirement: Unlock Travel Log ● Event Period: 2025/03/19 12:00:00 - 2025/04/08 15:00:00 (server time) ● Event Details: Trial characters \"Mydei (Destruction: Imaginary),\" \"Huohuo (Abundance: Wind),\" \"Arlan (Destruction: Lightning),\" \"Xueyi (Destruction: Quantum),\" and \"Natasha (Abundance: Physical)\" can be used to experience stages. Upon completing the challenges, players can obtain Stellar Jade, Adventure Log, Universal Enhancement Material, and credits.",
    "startDate": "2025-03-19T12:00:00",
    "endDate": "2025-04-08T15:00:00",
    "startTimestamp": 1742385600000,
    "endTimestamp": 1744120800000,
    "lastUpdated": "2025-04-24T20:40:20.070758",
    "sentiment": "neutral",
    "imageUrl": "/assets/images/events/event_37702787.png"
  },
  {
    "eventId": "37561378",
    "title": "Planar Fissure Event: Planar Ornaments Drop Rate Doubled for a Limited Time",
    "description": "Hello, Trailblazers! ▌ Event Period 2025/03/12 04:00:00 - 2025/03/19 03:59:00 (server time) ▌Participation Requirement Unlock Simulated Universe: World 3 ▌ Event Details ● During the Planar Fissure event, get double rewards from the Simulated Universe or Divergent Universe. ● You will get additional rewards on top of default drops after consuming an event double reward opportunity and Immersifiers (or Trailblaze Power). ● During the event, the number of double reward opportunities is limited and can be viewed in the Planar Fissure event page. ● The double reward count will not reset during the event. Be sure to schedule your time for this challenge accordingly, Trailblazers.",
    "startDate": "2025-03-12T04:00:00",
    "endDate": "2025-03-19T03:59:00",
    "startTimestamp": 1741752000000,
    "endTimestamp": 1742356740000,
    "lastUpdated": "2025-04-24T20:40:27.471701",
    "sentiment": "negative",
    "imageUrl": "/assets/images/events/event_37561378.png"
  },
  {
    "eventId": "37189509",
    "title": "Version 3.1 Store & Nameless Honor Update",
    "description": "Hello, Trailblazers! After the 3.1 version update, Nameless Honor and the store will be updated, with details as follows. ▌ Version 3.1 Nameless Honor Details During the event, Trailblazers can increase their Nameless Honor level to obtain rewards such as Star Rail Passes, Wishful Resin, Self-Modeling Resins, and Tracks of Destiny. After unlocking Nameless Glory, you will immediately obtain Stellar Jade ×680. By increasing Nameless Honor levels, you can additionally receive rewards such as Star Rail Special Pass ×4, a selected 4-star Light Cone, Variable Dice ×1, Wishful Resin ×1, Self-Modeling Resin ×1, Relic Remains, universal Path material Tears of Dreams, and more! If the Trailblazer unlocks Nameless Medal, in addition to the previous rewards, they will immediately increase their Honor level by 10 and will also obtain the avatars \"Tribbie: Delicacies\" and \"Mydei: Delicacies\", Stellar Jade ×200, and Fuel Rewards! ■ Opening Time After the Version 3.1 update – 2025/04/07 03:59:00 (Server Time) ■ Requirements Trailblaze Level ≥ 12 and have completed the Trailblaze Mission \"Jarilo-VI — Long Wait for the Blade's Edge\" ■ Nameless Honor Description ● After Nameless Honor is unlocked, the Nameless Gift will automatically be unlocked. Trailblazers can obtain EXP and increase their Nameless Honor level via This Week's Missions and This Period's Missions. The maximum Nameless Honor level is capped at Level 70. Attaining specific levels will allow the Trailblazer to obtain Star Rail Passes, Self-Modeling Resin, Tracks of Destiny, and more. ● This Week's Missions will reset every Monday at 04:00 (server time). ● Trailblazers who have unlocked Nameless Glory can purchase the Honor Badge to upgrade to Nameless Medal. ■ Reminders ● After reaching level cap, EXP will no longer be awarded through missions during this period. ● In the event of special circumstances leading to the repeated purchase of Nameless Glory or Nameless Medal, The Nameless EXP will not be accumulated, and Oneiric Shard ×750 (or Oneiric Shard ×1,410) will be refunded based on the price of the purchase. ● In the event of special circumstances leading to the repeated purchase of the Honor Badge, Oneiric Shards ×860 will be refunded. ● The purchase of Nameless Glory, Nameless Medal, and Honor Badge will be closed for this period at 2025/04/07 02:59:00 (Server Time). After the purchase is closed, Trailblazers can still complete the Nameless Honor missions and receive rewards. Please note the available purchase time and event period. ● In the webpage top-up center, the purchase deadline for Nameless Glory, Nameless Medal, and Honor Badge is 2025/04/06 03:59:00 (UTC+8). Trailblazers who top up via webpage should note the available purchase time. ▌ New Herta Contract Bundles ■ Availability Period After the Version 3.1 update – 2025/04/08 15:00:00 (Server Time) ■ Herta Contract: Roaming Refill Content: Traveler's Guide ×20, Refined Aether ×15, and credit ×60,000 Price: Oneiric Shard ×330. A maximum of 8 can be purchased per account while the item is available. ■ Herta Contract: Resource Supply V2 Content: Universal Path material Tears of Dreams ×150 and credit ×60,000 Price: Oneiric Shard ×660. A maximum of 5 can be purchased per account while the item is available. ▌ Outfit \"Nascent Spring\" Now Available ■ Availability Period After the Version 3.1 update ■ Outfit Description ● The outfit \"Nascent Spring\" is now available in the Contract Shop. The outfit is priced at Oneiric Shard ×1,680. ● \"Nascent Spring\" can only be used by March 7th (Preservation). ● Obtaining the outfit will unlock the outfit as well as the corresponding avatar. ● This outfit is limited to 1 piece per account and cannot be acquired repeatedly. ● After changing into \"Nascent Spring,\" March 7th will wear the corresponding outfit during exploration and in battle. ● Outfits worn will not change the outfit of March 7th during cinematics. ▌ New at Herta's Store ■ New Arrival Time After the Version 3.1 update ■ New Content ● 5-Star Light Cone \"Memory's Curtain Never Falls (Remembrance)\" ● Phone Wallpaper \"Task in Progress\" ● Avatar \"Hi, Come for a Test\" ● Collection \"Road of the Mundanite\" ● Collection \"Herta: Collector's Edition\" ● Collection \"Dr. Ratio — Bespoke Version\" ▌ New at Embers Exchange ■ New Arrival Time After the Version 3.1 update ※ Please note the exchange limit. Item availability will reset on the 1st day of every month at 04:00 (server time). ■ New Content Enemy dropped material \"Ethereal Omen\"\n▌ Event Details\nDuring the event, Trailblazers can increase their Nameless Honor level to obtain rewards such as Star Rail Passes, Wishful Resin, Self-Modeling Resins, and Tracks of Destiny.\nAfter unlocking Nameless Glory, you will immediately obtain Stellar Jade ×680. By increasing Nameless Honor levels, you can additionally receive rewards such as Star Rail Special Pass ×4, a selected 4-star Light Cone, Variable Dice ×1, Wishful Resin ×1, Self-Modeling Resin ×1, Relic Remains, universal Path material Tears of Dreams, and more!\nIf the Trailblazer unlocks Nameless Medal, in addition to the previous rewards, they will immediately increase their Honor level by 10 and will also obtain the avatars \"Tribbie: Delicacies\" and \"Mydei: Delicacies\", Stellar Jade ×200, and Fuel Rewards!\n\n■ Opening Time\nAfter the Version 3.1 update – 2025/04/07 03:59:00 (Server Time)\n\n■ Requirements\nTrailblaze Level ≥ 12 and have completed the Trailblaze Mission \"Jarilo-VI — Long Wait for the Blade's Edge\"\n\n■ Nameless Honor Description\n● After Nameless Honor is unlocked, the Nameless Gift will automatically be unlocked. Trailblazers can obtain EXP and increase their Nameless Honor level via This Week's Missions and This Period's Missions. The maximum Nameless Honor level is capped at Level 70. Attaining specific levels will allow the Trailblazer to obtain Star Rail Passes, Self-Modeling Resin, Tracks of Destiny, and more.\n● This Week's Missions will reset every Monday at 04:00 (server time).\n● Trailblazers who have unlocked Nameless Glory can purchase the Honor Badge to upgrade to Nameless Medal.\n\n■ Reminders\n● After reaching level cap, EXP will no longer be awarded through missions during this period.\n● In the event of special circumstances leading to the repeated purchase of Nameless Glory or Nameless Medal, The Nameless EXP will not be accumulated, and Oneiric Shard ×750 (or Oneiric Shard ×1,410) will be refunded based on the price of the purchase.\n● In the event of special circumstances leading to the repeated purchase of the Honor Badge, Oneiric Shards ×860 will be refunded.\n● The purchase of Nameless Glory, Nameless Medal, and Honor Badge will be closed for this period at 2025/04/07 02:59:00 (Server Time). After the purchase is closed, Trailblazers can still complete the Nameless Honor missions and receive rewards. Please note the available purchase time and event period.\n● In the webpage top-up center, the purchase deadline for Nameless Glory, Nameless Medal, and Honor Badge is 2025/04/06 03:59:00 (UTC+8). Trailblazers who top up via webpage should note the available purchase time.\n\n■ Availability Period\nAfter the Version 3.1 update\n\n■ Outfit Description\n● The outfit \"Nascent Spring\" is now available in the Contract Shop. The outfit is priced at Oneiric Shard ×1,680.\n● \"Nascent Spring\" can only be used by March 7th (Preservation).\n● Obtaining the outfit will unlock the outfit as well as the corresponding avatar.\n● This outfit is limited to 1 piece per account and cannot be acquired repeatedly.\n● After changing into \"Nascent Spring,\" March 7th will wear the corresponding outfit during exploration and in battle.\n● Outfits worn will not change the outfit of March 7th during cinematics.\n\n▌ New at Herta's Store\n■ New Arrival Time\nAfter the Version 3.1 update\n\n■ New Content\n● 5-Star Light Cone \"Memory's Curtain Never Falls (Remembrance)\"\n● Phone Wallpaper \"Task in Progress\"\n● Avatar \"Hi, Come for a Test\"\n● Collection \"Road of the Mundanite\"\n● Collection \"Herta: Collector's Edition\"\n● Collection \"Dr. Ratio — Bespoke Version\"\n\n▌ New at Embers Exchange",
    "startDate": "2025-02-26T11:00:00",
    "endDate": "2025-04-07T03:59:00",
    "startTimestamp": 1740567600000,
    "endTimestamp": 1743994740000,
    "lastUpdated": "2025-04-24T20:40:36.432986",
    "sentiment": "neutral",
    "version": "3.1",
    "imageUrl": "/assets/images/events/event_37189509.png"
  },
  {
    "eventId": "37034847",
    "title": "Garden of Plenty Event: Calyx Drop Rate Doubled for a Limited Time",
    "description": "Hello, Trailblazers! ▌ Event Period 2025/02/14 04:00:00 - 2025/02/21 03:59:00 (server time) ▌Participation Requirement Complete the Adventure Mission \"Calyx (Golden): Bud of Memories\" ▌ Event Details ● During the Garden of Plenty event, beat Calyx (Golden) and Calyx (Crimson) challenges to receive double rewards. ● You will get an additional set of rewards on top of default drops after consuming an event double reward opportunity and Trailblaze Power. ● The number of daily double reward opportunities is limited and can be viewed in the Garden of Plenty event page. ● Double reward opportunities refresh daily at 04:00 (server time). Make sure to use them before they're gone!",
    "startDate": "2025-02-14T04:00:00",
    "endDate": "2025-02-21T03:59:00",
    "startTimestamp": 1739505600000,
    "endTimestamp": 1740110340000,
    "lastUpdated": "2025-04-24T20:40:43.211538",
    "sentiment": "negative",
    "imageUrl": "/assets/images/events/event_37034847.png"
  },
  {
    "eventId": "36844003",
    "title": "Light Cone Event Warp: \"Brilliant Fixation\" & \"Coalesced Truths\"",
    "description": "Hello, Trailblazers! Light Cone Event Warp Period for this phase is 2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time), and includes the following content: ▌ Light Cone Event Warp: \"Brilliant Fixation\" ● During the event, the drop rates of the exclusive 5-star Light Cone \"Time Woven Into Gold (Remembrance)\" and 4-star Light Cones \"Geniuses' Greetings (Remembrance),\" \"Subscribe for More! (The Hunt),\" and \"Dance! Dance! Dance! (Harmony)\" will be boosted. ■Event Period 2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time) ■Drop Rate Boost: 5-Star Light Cone Time Woven Into Gold (Remembrance) ■Drop Rate Boost: 4-Star Light Cones Geniuses' Greetings (Remembrance) Subscribe for More! (The Hunt) Dance! Dance! Dance! (The Harmony) ▌ \"Coalesced Truths: Sailing Towards a Second Life\" Light Cone Event Warp ● During the event, the drop rates of the exclusive 5-star Light Cone \"Sailing Towards a Second Life (The Hunt)\" and 4-star Light Cones \"Geniuses' Greetings (Remembrance),\" \"Subscribe for More! (The Hunt),\" and \"Dance! Dance! Dance! (Harmony)\" will be boosted. ■Event Period 2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time) ■Drop Rate Boost: 5-Star Light Cone Sailing Towards a Second Life (The Hunt) ■Drop Rate Boost: 4-Star Light Cones Geniuses' Greetings (Remembrance) Subscribe for More! (The Hunt) Dance! Dance! Dance! (The Harmony) ▌ \"Coalesced Truths: Flowing Nightglow\" Light Cone Event Warp ● During the event, the drop rates of the exclusive 5-star Light Cone \"Flowing Nightglow (Harmony)\" and 4-star Light Cones \"Geniuses' Greetings (Remembrance),\" \"Subscribe for More! (The Hunt),\" and \"Dance! Dance! Dance! (Harmony)\" will be boosted. ■Event Period 2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time) ■Drop Rate Boost: 5-Star Light Cone Flowing Nightglow (Harmony) ■Drop Rate Boost: 4-Star Light Cones Geniuses' Greetings (Remembrance) Subscribe for More! (The Hunt) Dance! Dance! Dance! (The Harmony) ▌ \"Coalesced Truths: Incessant Rain\" Light Cone Event Warp ● During the event, the drop rates of the exclusive 5-star Light Cone \"Incessant Rain (Nihility)\" and 4-star Light Cones \"Geniuses' Greetings (Remembrance),\" \"Subscribe for More! (The Hunt),\" and \"Dance! Dance! Dance! (Harmony)\" will be boosted. ■Event Period 2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time) ■Drop Rate Boost: 5-Star Light Cone Incessant Rain (Nihility) ■Drop Rate Boost: 4-Star Light Cones Geniuses' Greetings (Remembrance) Subscribe for More! (The Hunt) Dance! Dance! Dance! (The Harmony) ※ Among the above Light Cones, the limited Light Cone will not become available in the Stellar Warp event. ※ During the event, the limited 5-star Light Cone \"Time Woven Into Gold (Remembrance)\" can only be obtained from the Light Cone Event Warp Brilliant Fixation, while the limited 5-star Light Cone \"Sailing Towards a Second Life (The Hunt),\" \"Flowing Nightglow (Harmony),\" and \"Incessant Rain (Nihility)\" can only be obtained from the Light Cone Event Warp Coalesced Truths. ※ After the event ends, 4-star Light Cone \"Geniuses' Greetings (Remembrance)\" will be added to Version 3.1's Stellar Warp but will not be added to Departure Warp. ※ This event is considered a Light Cone Event Warp. The cumulative Warp count for a guaranteed 5-star Light Cone in any Light Cone Event Warp will always be carried over to other Light Cone Event Warps, but is independent of and unaffected by other types of Warps. ※ \"Coalesced Truths\" Light Cone Event Warp will become available during irregular periods in future version updates. For more details, please stay tuned for official announcements. ※ For more information, please head to the Warp screen.\n▌ Event Details\n● During the event, the drop rates of the exclusive 5-star Light Cone \"Time Woven Into Gold (Remembrance)\" and 4-star Light Cones \"Geniuses' Greetings (Remembrance),\" \"Subscribe for More! (The Hunt),\" and \"Dance! Dance! Dance! (Harmony)\" will be boosted.\n\n■Event Period\n2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time)\n\n■Drop Rate Boost: 5-Star Light Cone\nTime Woven Into Gold (Remembrance)\n\n■Drop Rate Boost: 4-Star Light Cones\nGeniuses' Greetings (Remembrance)\nSubscribe for More! (The Hunt)\nDance! Dance! Dance! (The Harmony)\n\n▌ \"Coalesced Truths: Sailing Towards a Second Life\" Light Cone Event Warp\n● During the event, the drop rates of the exclusive 5-star Light Cone \"Sailing Towards a Second Life (The Hunt)\" and 4-star Light Cones \"Geniuses' Greetings (Remembrance),\" \"Subscribe for More! (The Hunt),\" and \"Dance! Dance! Dance! (Harmony)\" will be boosted.\n\n■Event Period\n2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time)\n\n■Drop Rate Boost: 5-Star Light Cone\nSailing Towards a Second Life (The Hunt)\n\n■Drop Rate Boost: 4-Star Light Cones\nGeniuses' Greetings (Remembrance)\nSubscribe for More! (The Hunt)\nDance! Dance! Dance! (The Harmony)\n\n▌ \"Coalesced Truths: Flowing Nightglow\" Light Cone Event Warp\n● During the event, the drop rates of the exclusive 5-star Light Cone \"Flowing Nightglow (Harmony)\" and 4-star Light Cones \"Geniuses' Greetings (Remembrance),\" \"Subscribe for More! (The Hunt),\" and \"Dance! Dance! Dance! (Harmony)\" will be boosted.\n\n■Event Period\n2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time)\n\n■Drop Rate Boost: 5-Star Light Cone\nFlowing Nightglow (Harmony)\n\n■Drop Rate Boost: 4-Star Light Cones\nGeniuses' Greetings (Remembrance)\nSubscribe for More! (The Hunt)\nDance! Dance! Dance! (The Harmony)\n\n▌ \"Coalesced Truths: Incessant Rain\" Light Cone Event Warp\n● During the event, the drop rates of the exclusive 5-star Light Cone \"Incessant Rain (Nihility)\" and 4-star Light Cones \"Geniuses' Greetings (Remembrance),\" \"Subscribe for More! (The Hunt),\" and \"Dance! Dance! Dance! (Harmony)\" will be boosted.\n\n■Event Period\n2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time)\n\n■Drop Rate Boost: 5-Star Light Cone\nIncessant Rain (Nihility)\n\n■Drop Rate Boost: 4-Star Light Cones\nGeniuses' Greetings (Remembrance)\nSubscribe for More! (The Hunt)\nDance! Dance! Dance! (The Harmony)\n\n※ Among the above Light Cones, the limited Light Cone will not become available in the Stellar Warp event.\n※ During the event, the limited 5-star Light Cone \"Time Woven Into Gold (Remembrance)\" can only be obtained from the Light Cone Event Warp Brilliant Fixation, while the limited 5-star Light Cone \"Sailing Towards a Second Life (The Hunt),\" \"Flowing Nightglow (Harmony),\" and \"Incessant Rain (Nihility)\" can only be obtained from the Light Cone Event Warp Coalesced Truths.\n※ After the event ends, 4-star Light Cone \"Geniuses' Greetings (Remembrance)\" will be added to Version 3.1's Stellar Warp but will not be added to Departure Warp.\n※ This event is considered a Light Cone Event Warp. The cumulative Warp count for a guaranteed 5-star Light Cone in any Light Cone Event Warp will always be carried over to other Light Cone Event Warps, but is independent of and unaffected by other types of Warps.\n※ \"Coalesced Truths\" Light Cone Event Warp will become available during irregular periods in future version updates. For more details, please stay tuned for official announcements.\n※ For more information, please head to the Warp screen.\n",
    "startDate": "2025-02-05T12:00:00",
    "endDate": "2025-02-25T15:00:00",
    "startTimestamp": 1738756800000,
    "endTimestamp": 1740495600000,
    "lastUpdated": "2025-04-24T20:40:50.345993",
    "sentiment": "negative",
    "imageUrl": "/assets/images/events/event_36844003.png"
  },
  {
    "eventId": "36843932",
    "title": "Character Event Warp: Tailored Fate & Indelible Coterie",
    "description": "Hello, Trailblazers! Character Event Warp Period for this phase is 2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time), and includes the following content: ▌ \"Tailored Fate\" Character Event Warp ● During the event, the drop rates of the limited 5-star character Aglaea (Remembrance: Lightning) and the 4-star characters Tingyun (Harmony: Lightning), Hanya (Harmony: Physical), and Sushang (The Hunt: Physical) will be boosted for a limited time. ■Event Period 2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time) ■Drop Rate Boost: 5-Star Character Aglaea (Remembrance: Lightning) ■Drop Rate Boost: 4-Star Characters Tingyun (Harmony: Lightning) Hanya (Harmony: Physical) Sushang (The Hunt: Physical) ▌ \"Indelible Coterie: Boothill\" Character Event Warp ● During the event, the drop rates of the limited 5-star character Boothill (The Hunt: Physical) and the 4-star characters Tingyun (Harmony: Lightning), Hanya (Harmony: Physical), and Sushang (The Hunt: Physical) will be boosted for a limited time. ■Event Period 2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time) ■Drop Rate Boost: 5-Star Character Boothill (The Hunt: Physical) ■Drop Rate Boost: 4-Star Characters Tingyun (Harmony: Lightning) Hanya (Harmony: Physical) Sushang (The Hunt: Physical) ▌ \"Indelible Coterie: Robin\" Character Event Warp ● During the event, the drop rates of the limited 5-star character Robin (Harmony: Physical) and the 4-star characters Tingyun (Harmony: Lightning), Hanya (Harmony: Physical), and Sushang (The Hunt: Physical) will be boosted for a limited time. ■Event Period 2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time) ■Drop Rate Boost: 5-Star Character Robin (Harmony: Physical) ■Drop Rate Boost: 4-Star Characters Tingyun (Harmony: Lightning) Hanya (Harmony: Physical) Sushang (The Hunt: Physical) ▌ \"Indelible Coterie: Silver Wolf\" Character Event Warp ● During the event, the drop rates of the limited 5-star character Silver Wolf (Nihility: Quantum) and the 4-star characters Tingyun (Harmony: Lightning), Hanya (Harmony: Physical), and Sushang (The Hunt: Physical) will be boosted for a limited time. ■Event Period 2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time) ■Drop Rate Boost: 5-Star Character Silver Wolf (Nihility: Quantum) ■Drop Rate Boost: 4-Star Characters Tingyun (Harmony: Lightning) Hanya (Harmony: Physical) Sushang (The Hunt: Physical) ※ Among the above characters, the limited character will not be available in the Stellar Warp event. ※ During the event, the limited 5-star character Aglaea (Remembrance: Lightning) can only be obtained from the Character Event Warp \"Tailored Fate,\" while the limited 5-star character Boothill (The Hunt: Physical), Robin (Harmony: Physical), and Silver Wolf (Nihility: Quantum) can only be obtained from the Character Event Warp \"Indelible Coterie.\" ※ This Warp is considered a Character Event Warp. The cumulative Warp count for a guaranteed 5-star character in any Character Event Warp will always be carried over to other Character Event Warps, but is independent of and unaffected by other types of Warps. ※ \"Indelible Coterie\" Character Event Warp will become available during irregular periods in future version updates. For more details, please stay tuned for official announcements. ※ For more information, please head to the Warp screen. ▌Character Trial Event: Aptitude Showcase ● Requirement: Unlock Travel Log ● Event Period: 2025/02/05 12:00:00 – 2025/02/25 15:00:00 (server time) ● Event Details: Trial characters Aglaea (Remembrance: Lightning), Boothill (The Hunt: Physical), Robin (Harmony: Physical), Silver Wolf (Nihility: Quantum), Tingyun (Harmony: Lightning), Hanya (Harmony: Physical), Sushang (The Hunt: Physical) can be used to experience stages. Upon completing the challenges, Trailblazers can obtain Stellar Jade, Adventure Log, Universal Enhancement Material, and Credit.",
    "startDate": "2025-02-05T12:00:00",
    "endDate": "2025-02-25T15:00:00",
    "startTimestamp": 1738756800000,
    "endTimestamp": 1740495600000,
    "lastUpdated": "2025-04-24T20:40:56.005858",
    "sentiment": "neutral",
    "imageUrl": "/assets/images/events/event_36843932.png"
  },
  {
    "eventId": "36767294",
    "title": "Enscrolled Crepusculum: Defeat the enemies in stories and obtain Tracks of Destiny and other rewards",
    "description": "A lost child has appeared in the bustling market of Okhema. She glances around, seemingly trying to find something... ▌ Event Period 2025/02/03 12:00:00 – 2025/02/24 03:59:00 (server time) ▌Participation Requirement Trailblaze Level ≥ 21 ※ This content can be unlocked and experienced in advance through the Finality's Vision function. ※ It is recommended that Trailblazers complete Trailblaze Mission \"\"Amphoreus — Hero, Bear Thy Coreflame\" before experiencing this content. ▌ Event Rewards ▌ Event Details ● In this event, there are five scrolls to collect, corresponding to 5 combat stages. The Trailblazer needs to locate them in different areas, then defeat story opponents. ● Each stage from Stages 1–4 features a key enemy that possesses a corresponding Mutation Mechanic. Targeting the enemy's Mutation Mechanic is an efficient way to defeat the enemy. ● Every stage from Stages 1–4 all have their corresponding Stage Buffs. During battle, triggering the Mutation Mechanic will increase your Stage Buff rank and increase your characters' combat effectiveness. ● Stages 1–4 consist of the Buff Buildup and Final Showdown phases. ● In the Buff Buildup phase, there is a countdown of 3 Cycles where the enemies will continuously spawn. In this phase, you need to exploit key enemies' Mutation Mechanic to raise the Stage Buff rank as much as possible. ● In the Final Showdown, Trailblazers must defeat as many enemies as they can for a higher score in 4 Cycles. If you have leftover Cycles when you pass the stage, you will receive extra scores. Additionally, Stage Buff ranks cannot be increased during the Final Showdown. ● Stage 5 is the Titan challenge boss fight. Before you enter the stage, select any 2 accumulated Stage Buff from Stages 1–4 and use them for the final boss fight. (You can inherit the highest Stage Buff rank you've historically obtained in Stages 1–4). Defeat as many waves of enemies as possible within 4 Cycles to receive a higher score. If you have leftover Cycles when you pass the stage, you will receive extra scores. ▌ Attention ● The 5 combat stages will be gradually unlocked on a daily basis, and the fifth stage will only be unlocked after you have scored in the first four stages. ● Increasing the Equilibrium Level will also increase enemy levels. ● In the Enscrolled Crepusculum game mode, when ally targets defeat enemy targets, they regenerate only 50% of the Energy that they would normally do in regular battles.",
    "startDate": "2025-02-03T12:00:00",
    "endDate": "2025-02-24T03:59:00",
    "startTimestamp": 1738584000000,
    "endTimestamp": 1740369540000,
    "lastUpdated": "2025-04-24T20:41:04.493461",
    "sentiment": "neutral",
    "imageUrl": "/assets/images/events/event_36767294.jpg"
  },
  {
    "eventId": "36634082",
    "title": "Planar Fissure Event: Planar Ornaments Drop Rate Doubled for a Limited Time",
    "description": "Hello, Trailblazers! ▌ Event Period 2025/01/27 04:00:00 – 2025/02/03 03:59:00 (server time) ▌Participation Requirement Unlock Simulated Universe: World 3 ▌ Event Details ● During the Planar Fissure event period, get double rewards from the Simulated Universe or Divergent Universe. ● You will get additional rewards on top of default drops after consuming an event double reward opportunity and Immersifiers (or Trailblaze Power). ● During the event, the number of double reward opportunities is limited and can be viewed in the Planar Fissure event page. ● The double reward count will not reset during the event. Be sure to schedule your time for this challenge accordingly, Trailblazers.",
    "startDate": "2025-01-27T04:00:00",
    "endDate": "2025-02-03T03:59:00",
    "startTimestamp": 1737950400000,
    "endTimestamp": 1738555140000,
    "lastUpdated": "2025-04-24T20:41:09.086786",
    "sentiment": "negative",
    "imageUrl": "/assets/images/events/event_36634082.png"
  },
  {
    "eventId": "36633597",
    "title": "Cosmic Lucky Prize Event Details",
    "description": "Hello, Trailblazers! ▌ Event Period Event Period: 2025/01/27 04:00:00 (server time) – 2025/02/26 06:00:00 (UTC+8) Prize Draw Period: 2025/01/27 04:00:00 – 2025/02/02 23:59:00 (server time) Draw Entry Time: Starting from Phase 2, each phase refreshes at 00:00 (Server Time) daily. ● Phase 1: 2025/01/27 04:00:00 – 2025/01/27 23:59:00 (server time) ● Phases 2–7: Daily from 00:00 to 23:59 (Server Time), 2025/01/28 through 2025/02/02 Winner Announcement Time: Results for each phase will be revealed at 21:00 (UTC+8) the following day. Here are the times for each server: ● America Server: Following day at 08:00 (Server Time) ● Europe Server: Following day at 14:00 (Server Time) ● Asia Server: Following day at 21:00 (Server Time) ● TW,HK,MO Server: Following day at 21:00 (Server Time) ※ When the prize draw phase ends, Trailblazers can still claim fixed rewards for the event. View the rules below for exact rules. ▌ Event Participation Rules ● The event is divided into 7 phases, with a new phase of the prize draw being released each day starting from the 1st day of the event. ● Trailblazers can choose to participate in the prize draw or directly claim a fixed reward of 100 Stellar Jades before the deadline of each phase (specific times are shown on the event interface). Only one option can be selected. Different options can be picked for each phase's prize draw. ● If no action is taken during the prize draw period, the default reward of fixed Stellar Jades will be granted, and the prize draw will not be participated in. If Trailblazers did not log in to the game during the prize draw phases, logging into the game before the event ends allows them to claim 800 Stellar Jades at once. ● Each phase's prize draw results will be announced the following day, with specific times displayed on the event interface. ● All rewards must be claimed from the event page during the event. ● Any rewards earned but not claimed during the event period will be forfeited and cannot be recovered or reissued. ● The America, Europe, Asia, and TW,HK,MO servers share a single prize pool. A total of 20 Trailblazers can become Lucky Superstars across the 7 phases. ▌ Prize Draw Reward ● Lucky Superstar: 500,000 Stellar Jades ● First Prize: 600 Stellar Jades ● Second Prize: 50 Stellar Jades ▌ Prize Draw Rules ● In phases 1, 2, and 3, there will be 2 Trailblazers per phase who have a chance to become the Lucky Superstar. In phases 4, 5, and 6, there will be 3 Trailblazers per phase who have a chance to become the Lucky Superstar. In phase 7, 5 Trailblazers will have a chance to become the Lucky Superstar. ● In each phase's prize draw, if a Trailblazer participates but does not become the Lucky Superstar, there will be a 10% chance to win the First Prize and a 90% chance to win the Second Prize. ● In each phase, Trailblazers can only win one of the following: Lucky Superstar, First Prize, or Second Prize. The rewards cannot overlap. ● Across all 7 phases, a Trailblazer can only become the Lucky Superstar once. The same Trailblazer cannot be selected as the Lucky Superstar multiple times. ▌ Lucky Superstar Rules Reminder ● If you have violated the HoYoverse Terms of Service while using HoYoverse's services, you will automatically forfeit your eligibility to win the Lucky Superstar reward. ● You must comply with all applicable laws in your country or region to participate in this event. ● If you are a minor in your country or region, you must obtain guardian consent as required by applicable laws before participating in this prize draw event. ● If you are selected as a Lucky Superstar, HoYoverse may need to collect and process your personal information in accordance with applicable laws and with your explicit consent. ● Matters not covered in this event, as well as subsequent player actions, will remain subject to the Honkai: Star Rail Game Terms of Service you have confirmed. ※ For complete event rules, please check the in-game event details. ▌ Lucky Superstar Phase 1 ▌ Lucky Superstar Phase 2 ▌ Lucky Superstar Phase 3 ▌ Lucky Superstar Phase 4 ▌ Lucky Superstar Phase 5 ▌ Lucky Superstar Phase 6 ▌ Lucky Superstar Phase 7 ※ Official winner list is subject to in-game announcements. ※ The above list only showcases Lucky Superstars from America, Europe, Asia, and TW, HK, MO servers.\n▌ Event Details\nEvent Period: 2025/01/27 04:00:00 (server time) – 2025/02/26 06:00:00 (UTC+8)\nPrize Draw Period: 2025/01/27 04:00:00 – 2025/02/02 23:59:00 (server time)\n\nDraw Entry Time: Starting from Phase 2, each phase refreshes at 00:00 (Server Time) daily.\n● Phase 1: 2025/01/27 04:00:00 – 2025/01/27 23:59:00 (server time)\n● Phases 2–7: Daily from 00:00 to 23:59 (Server Time), 2025/01/28 through 2025/02/02\n\nWinner Announcement Time: Results for each phase will be revealed at 21:00 (UTC+8) the following day. Here are the times for each server:\n● America Server: Following day at 08:00 (Server Time)\n● Europe Server: Following day at 14:00 (Server Time)\n● Asia Server: Following day at 21:00 (Server Time)\n● TW,HK,MO Server: Following day at 21:00 (Server Time)\n※ When the prize draw phase ends, Trailblazers can still claim fixed rewards for the event. View the rules below for exact rules.\n\n▌ Event Participation Rules\n● The event is divided into 7 phases, with a new phase of the prize draw being released each day starting from the 1st day of the event.\n● Trailblazers can choose to participate in the prize draw or directly claim a fixed reward of 100 Stellar Jades before the deadline of each phase (specific times are shown on the event interface). Only one option can be selected. Different options can be picked for each phase's prize draw.\n● If no action is taken during the prize draw period, the default reward of fixed Stellar Jades will be granted, and the prize draw will not be participated in. If Trailblazers did not log in to the game during the prize draw phases, logging into the game before the event ends allows them to claim 800 Stellar Jades at once.\n● Each phase's prize draw results will be announced the following day, with specific times displayed on the event interface.\n● All rewards must be claimed from the event page during the event.\n● Any rewards earned but not claimed during the event period will be forfeited and cannot be recovered or reissued.\n● The America, Europe, Asia, and TW,HK,MO servers share a single prize pool. A total of 20 Trailblazers can become Lucky Superstars across the 7 phases.\n\n▌ Prize Draw Reward\n● Lucky Superstar: 500,000 Stellar Jades\n● First Prize: 600 Stellar Jades\n● Second Prize: 50 Stellar Jades\n\n▌ Prize Draw Rules\n● In phases 1, 2, and 3, there will be 2 Trailblazers per phase who have a chance to become the Lucky Superstar. In phases 4, 5, and 6, there will be 3 Trailblazers per phase who have a chance to become the Lucky Superstar. In phase 7, 5 Trailblazers will have a chance to become the Lucky Superstar.\n● In each phase's prize draw, if a Trailblazer participates but does not become the Lucky Superstar, there will be a 10% chance to win the First Prize and a 90% chance to win the Second Prize.\n● In each phase, Trailblazers can only win one of the following: Lucky Superstar, First Prize, or Second Prize. The rewards cannot overlap.\n● Across all 7 phases, a Trailblazer can only become the Lucky Superstar once. The same Trailblazer cannot be selected as the Lucky Superstar multiple times.\n\n▌ Lucky Superstar Rules Reminder\n● If you have violated the HoYoverse Terms of Service while using HoYoverse's services, you will automatically forfeit your eligibility to win the Lucky Superstar reward.\n● You must comply with all applicable laws in your country or region to participate in this event.\n● If you are a minor in your country or region, you must obtain guardian consent as required by applicable laws before participating in this prize draw event.\n● If you are selected as a Lucky Superstar, HoYoverse may need to collect and process your personal information in accordance with applicable laws and with your explicit consent.\n● Matters not covered in this event, as well as subsequent player actions, will remain subject to the Honkai: Star Rail Game Terms of Service you have confirmed.\n\n※ For complete event rules, please check the in-game event details.\n▌ Lucky Superstar Phase 1",
    "startDate": "2025-01-27T04:00:00",
    "endDate": "2025-02-26T06:00:00",
    "startTimestamp": 1737950400000,
    "endTimestamp": 1740549600000,
    "lastUpdated": "2025-04-24T20:41:16.661438",
    "sentiment": "neutral",
    "imageUrl": "/assets/images/events/event_36633597.png"
  },
  {
    "eventId": "36471191",
    "title": "Hypogeum Enigma: Participate in exploring the hypogeum to obtain Tracks of Destiny and get a 4-star character",
    "description": "Hello, Trailblazers! The explorer Damionis is preparing to explore the ancient city ruins... He seems to have forgotten to invite you? ▌ Limited-Time Event Period 2025/01/22 12:00:00 – 2025/02/24 03:59:00 (server time) ※ After the limited-time event concludes, Hypogeum Enigma will be moved to Conventional Memoir, where Trailblazers can continue to experience its gameplay. ▌Participation Requirement Trailblaze Level ≥ 21 ※ This content can be unlocked and experienced in advance through the Finality's Vision function. ※ It's recommended that Trailblazers experience this content after finishing the Trailblaze Mission \"Amphoreus — A Witch's Scientific Repose.\" ▌ Event Rewards ■ Limited-Time Rewards ※ Fateful Crossings: Hypogeum Enigma — You can select a character out of the 4-star characters Guinaifen (Nihility: Fire), Hanya (Harmony: Physical), Tingyun (Harmony: Lightning), and Hook (Destruction: Fire). ■ Regular Rewards ▌ Event Details ● This event has 4 game modes in total and 20 stages to clear. ● Every game mode is separated between the Shallow Hypogeum and Deep Hypogeum difficulties. After completing Shallow Hypogeum, Deep Hypogeum will be unlocked. ● The game modes Prophecy Tablet and Golden Scapegoat include 3 Shallow Hypogeum rooms and 3 Deep Hypogeum rooms. The game modes Hand of Zagreus and Oronyx's Miracle include 2 Shallow Hypogeum rooms and 2 Deep Hypogeum rooms. ● After the event begins, the first room to the Prophecy Tablet mode in Shallow Hypogeum will open. Remove the room's seal to unlock the next room. Explore all rooms under this difficulty for the game mode to unlock the next mode and so on. ▌ Note ● After the limited event period has concluded, Trailblazers will no longer be able to obtain the limited-time event rewards. However, they can still go to Damionis in the Eternal Holy City Okhema to experience the event and earn regular rewards.",
    "startDate": "2025-01-22T12:00:00",
    "endDate": "2025-02-24T03:59:00",
    "startTimestamp": 1737547200000,
    "endTimestamp": 1740369540000,
    "lastUpdated": "2025-04-24T20:41:22.789693",
    "sentiment": "negative",
    "imageUrl": "/assets/images/events/event_36471191.jpg"
  },
  {
    "eventId": "36341346",
    "title": "Light Cone Event Warp: Brilliant Fixation & Coalesced Truths",
    "description": "Hello, Trailblazers! Light Cone Event Warp Period for this phase is after the Version 3.0 update – 2025/02/05 11:59:00 (server time), and includes the following content: ▌ Light Cone Event Warp: \"Brilliant Fixation\" ● During the event, the drop rates of the limited 5-star Light Cone \"Into the Unreachable Veil (Erudition)\" and 4-star Light Cones \"Only Silence Remains (The Hunt),\" \"Landau's Choice (Preservation),\" and \"Geniuses' Repose (Erudition)\" will be boosted. ■Event Period After the Version 3.0 update – 2025/02/05 11:59:00 (server time) ■Drop Rate Boost: 5-Star Light Cone Into the Unreachable Veil (Erudition) ■Drop Rate Boost: 4-Star Light Cones Only Silence Remains (The Hunt) Landau's Choice (Preservation) Geniuses' Repose (Erudition) ▌ \"Coalesced Truths: Scent Alone Stays True\" Light Cone Event Warp ● During the event, the drop rates of the limited 5-star Light Cone \"Scent Alone Stays True (Abundance)\" and 4-star Light Cones \"Only Silence Remains (The Hunt),\" \"Landau's Choice (Preservation),\" and \"Geniuses' Repose (Erudition)\" will be boosted. ■Event Period After the Version 3.0 update – 2025/02/05 11:59:00 (server time) ■Drop Rate Boost: 5-Star Light Cone Scent Alone Stays True (Abundance) ■Drop Rate Boost: 4-Star Light Cones Only Silence Remains (The Hunt) Landau's Choice (Preservation) Geniuses' Repose (Erudition) ▌ \"Coalesced Truths: I Venture Forth to Hunt\" Light Cone Event Warp ● During the event, the drop rates of the limited 5-star Light Cone \"I Venture Forth to Hunt (The Hunt)\" and 4-star Light Cones \"Only Silence Remains (The Hunt),\" \"Landau's Choice (Preservation),\" and \"Geniuses' Repose (Erudition)\" will be boosted. ■Event Period After the Version 3.0 update – 2025/02/05 11:59:00 (server time) ■Drop Rate Boost: 5-Star Light Cone I Venture Forth to Hunt (The Hunt) ■Drop Rate Boost: 4-Star Light Cones Only Silence Remains (The Hunt) Landau's Choice (Preservation) Geniuses' Repose (Erudition) ▌ \"Coalesced Truths: Yet Hope Is Priceless\" Light Cone Event Warp ● During the event, the drop rates of the limited 5-star Light Cone \"Yet Hope Is Priceless (Erudition)\" and 4-star Light Cones \"Only Silence Remains (The Hunt),\" \"Landau's Choice (Preservation),\" and \"Geniuses' Repose (Erudition)\" will be boosted. ■Event Period After the Version 3.0 update – 2025/02/05 11:59:00 (server time) ■Drop Rate Boost: 5-Star Light Cone Yet Hope Is Priceless (Erudition) ■Drop Rate Boost: 4-Star Light Cones Only Silence Remains (The Hunt) Landau's Choice (Preservation) Geniuses' Repose (Erudition) ※ Among the above Light Cones, the limited Light Cone will not become available in the Stellar Warp event. ※ During the event, the limited 5-star Light Cone \"Into the Unreachable Veil (Erudition)\" can only be obtained from the Light Cone Event Warp Brilliant Fixation, while the limited 5-star Light Cone \"Scent Alone Stays True (Abundance),\" \"I Venture Forth to Hunt (The Hunt),\" and \"Yet Hope Is Priceless (Erudition)\" can only be obtained from the Light Cone Event Warp Coalesced Truths. ※ This event is considered a Light Cone Event Warp. The cumulative Warp count for a guaranteed 5-star Light Cone in any Light Cone Event Warp will always be carried over to other Light Cone Event Warps, but is independent of and unaffected by other types of Warps. ※ \"Coalesced Truths\" Light Cone Event Warp will become available during irregular periods in future version updates. For more details, please stay tuned for official announcements. ※ For more information, please head to the Warp screen.\n▌ Event Details\n● During the event, the drop rates of the limited 5-star Light Cone \"Into the Unreachable Veil (Erudition)\" and 4-star Light Cones \"Only Silence Remains (The Hunt),\" \"Landau's Choice (Preservation),\" and \"Geniuses' Repose (Erudition)\" will be boosted.\n\n■Event Period\nAfter the Version 3.0 update – 2025/02/05 11:59:00 (server time)\n\n■Drop Rate Boost: 5-Star Light Cone\nInto the Unreachable Veil (Erudition)\n\n■Drop Rate Boost: 4-Star Light Cones\nOnly Silence Remains (The Hunt)\nLandau's Choice (Preservation)\nGeniuses' Repose (Erudition)\n\n▌ \"Coalesced Truths: Scent Alone Stays True\" Light Cone Event Warp\n● During the event, the drop rates of the limited 5-star Light Cone \"Scent Alone Stays True (Abundance)\" and 4-star Light Cones \"Only Silence Remains (The Hunt),\" \"Landau's Choice (Preservation),\" and \"Geniuses' Repose (Erudition)\" will be boosted.\n\n■Event Period\nAfter the Version 3.0 update – 2025/02/05 11:59:00 (server time)\n\n■Drop Rate Boost: 5-Star Light Cone\nScent Alone Stays True (Abundance)\n\n■Drop Rate Boost: 4-Star Light Cones\nOnly Silence Remains (The Hunt)\nLandau's Choice (Preservation)\nGeniuses' Repose (Erudition)\n\n▌ \"Coalesced Truths: I Venture Forth to Hunt\" Light Cone Event Warp\n● During the event, the drop rates of the limited 5-star Light Cone \"I Venture Forth to Hunt (The Hunt)\" and 4-star Light Cones \"Only Silence Remains (The Hunt),\" \"Landau's Choice (Preservation),\" and \"Geniuses' Repose (Erudition)\" will be boosted.\n\n■Event Period\nAfter the Version 3.0 update – 2025/02/05 11:59:00 (server time)\n\n■Drop Rate Boost: 5-Star Light Cone\nI Venture Forth to Hunt (The Hunt)\n\n■Drop Rate Boost: 4-Star Light Cones\nOnly Silence Remains (The Hunt)\nLandau's Choice (Preservation)\nGeniuses' Repose (Erudition)\n\n● During the event, the drop rates of the limited 5-star Light Cone \"Yet Hope Is Priceless (Erudition)\" and 4-star Light Cones \"Only Silence Remains (The Hunt),\" \"Landau's Choice (Preservation),\" and \"Geniuses' Repose (Erudition)\" will be boosted.\n\n■Event Period\nAfter the Version 3.0 update – 2025/02/05 11:59:00 (server time)\n\n■Drop Rate Boost: 5-Star Light Cone\nYet Hope Is Priceless (Erudition)\n\n■Drop Rate Boost: 4-Star Light Cones\nOnly Silence Remains (The Hunt)\nLandau's Choice (Preservation)\nGeniuses' Repose (Erudition)\n\n※ Among the above Light Cones, the limited Light Cone will not become available in the Stellar Warp event.\n※ During the event, the limited 5-star Light Cone \"Into the Unreachable Veil (Erudition)\" can only be obtained from the Light Cone Event Warp Brilliant Fixation, while the limited 5-star Light Cone \"Scent Alone Stays True (Abundance),\" \"I Venture Forth to Hunt (The Hunt),\" and \"Yet Hope Is Priceless (Erudition)\" can only be obtained from the Light Cone Event Warp Coalesced Truths.\n※ This event is considered a Light Cone Event Warp. The cumulative Warp count for a guaranteed 5-star Light Cone in any Light Cone Event Warp will always be carried over to other Light Cone Event Warps, but is independent of and unaffected by other types of Warps.\n※ \"Coalesced Truths\" Light Cone Event Warp will become available during irregular periods in future version updates. For more details, please stay tuned for official announcements.\n※ For more information, please head to the Warp screen.\n",
    "startDate": "2025-01-15T11:00:00",
    "endDate": "2025-02-05T11:59:00",
    "startTimestamp": 1736938800000,
    "endTimestamp": 1738756740000,
    "lastUpdated": "2025-04-24T20:41:30.392763",
    "sentiment": "neutral",
    "version": "3.0",
    "imageUrl": "/assets/images/events/event_36341346.png"
  },
  {
    "eventId": "36341290",
    "title": "Character Event Warp: Message From Beyond & Indelible Coterie",
    "description": "Hello, Trailblazers! Character Event Warp Period for this phase is after the Version 3.0 update – 2025/02/05 11:59:00 (server time), and includes the following content: ▌ \"Message From Beyond\" Character Event Warp ● During the event, the drop rates of the limited 5-star character The Herta (Erudition: Ice) and 4-star characters Natasha (Abundance: Physical), Asta (Harmony: Fire), and Moze (The Hunt: Lightning) will be boosted. ■Event Period After the Version 3.0 update – 2025/02/05 11:59:00 (server time) ■Drop Rate Boost: 5-Star Character The Herta (Erudition: Ice) ■Drop Rate Boost: 4-Star Characters Natasha (Abundance: Physical) Asta (Harmony: Fire) Moze (The Hunt: Lightning) ▌ \"Indelible Coterie: Lingsha\" Character Event Warp ● During the event, the drop rates of the limited 5-star character Lingsha (Abundance: Fire) and 4-star characters Natasha (Abundance: Physical), Asta (Harmony: Fire), and Moze (The Hunt: Lightning) will be boosted. ■Event Period After the Version 3.0 update – 2025/02/05 11:59:00 (server time) ■Drop Rate Boost: 5-Star Character Lingsha (Abundance: Fire) ■Drop Rate Boost: 4-Star Characters Natasha (Abundance: Physical) Asta (Harmony: Fire) Moze (The Hunt: Lightning) ▌ \"Indelible Coterie: Feixiao\" Character Event Warp ● During the event, the drop rates of the limited 5-star character Feixiao (The Hunt: Wind) and 4-star characters Natasha (Abundance: Physical), Asta (Harmony: Fire), and Moze (The Hunt: Lightning) will be boosted. ■Event Period After the Version 3.0 update – 2025/02/05 11:59:00 (server time) ■Drop Rate Boost: 5-Star Character Feixiao (The Hunt: Wind) ■Drop Rate Boost: 4-Star Characters Natasha (Abundance: Physical) Asta (Harmony: Fire) Moze (The Hunt: Lightning) ▌ \"Indelible Coterie: Jade\" Character Event Warp ● During the event, the drop rates of the limited 5-star character Jade (Erudition: Quantum) and 4-star characters Natasha (Abundance: Physical), Asta (Harmony: Fire), and Moze (The Hunt: Lightning) will be boosted. ■Event Period After the Version 3.0 update – 2025/02/05 11:59:00 (server time) ■Drop Rate Boost: 5-Star Character Jade (Erudition: Quantum) ■Drop Rate Boost: 4-Star Characters Natasha (Abundance: Physical) Asta (Harmony: Fire) Moze (The Hunt: Lightning) ※ Among the above characters, the limited character will not be available in the Stellar Warp event. ※ During the event, the limited 5-star character The Herta (Erudition: Ice) can only be obtained from the Character Event Warp \"Message From Beyond,\" while the limited 5-star character Lingsha (Abundance: Fire), Feixiao (The Hunt: Wind), and Jade (Erudition: Quantum) can only be obtained from the Character Event Warp \"Indelible Coterie.\" ※ This Warp is considered a Character Event Warp. The cumulative Warp count for a guaranteed 5-star character in any Character Event Warp will always be carried over to other Character Event Warps, but is independent of and unaffected by other types of Warps. ※ \"Indelible Coterie\" Character Event Warp will become available during irregular periods in future version updates. For more details, please stay tuned for official announcements. ※ For more information, please head to the Warp screen. ▌Character Trial Event: Aptitude Showcase ● Requirement: Unlock Travel Log ● Event Period: After the Version 3.0 update – 2025/02/05 11:59:00 (server time) ● Event Details: Trial characters The Herta (Erudition: Ice), Lingsha (Abundance: Fire), Feixiao (The Hunt: Wind), Jade (Erudition: Quantum), Natasha (Abundance: Physical), Asta (Harmony: Fire), and Moze (The Hunt: Lightning) can be used to experience stages. Upon completing the challenges, Trailblazers can obtain Stellar Jade, Adventure Log, Universal Enhancement Material, and Credit.",
    "startDate": "2025-01-15T11:00:00",
    "endDate": "2025-02-05T11:59:00",
    "startTimestamp": 1736938800000,
    "endTimestamp": 1738756740000,
    "lastUpdated": "2025-04-24T20:41:38.252130",
    "sentiment": "neutral",
    "version": "3.0",
    "imageUrl": "/assets/images/events/event_36341290.png"
  },
  {
    "eventId": "36323609",
    "title": "Mem's Gift: During the event period, log into the game to get Star Rail Special Pass ×10 and Variable Dice ×1!",
    "description": "Hello, Trailblazers! Mem brought you a generous gift. Take it, and don't forget to thank them. ▌ Event Period After the version 3.0 update – 2025/02/26 06:00:00 (UTC+8) ▌Participation Requirement Unlock Travel Log ▌ Event Details When logging into the game during the event period, Trailblazers can obtain rewards from the Travel Log — Mem's Gift: Star Rail Special Pass ×10 and Variable Dice ×1!",
    "startDate": "2025-01-15T11:00:00",
    "endDate": "2025-02-26T06:00:00",
    "startTimestamp": 1736938800000,
    "endTimestamp": 1740549600000,
    "lastUpdated": "2025-04-24T20:41:43.298408",
    "sentiment": "neutral",
    "version": "3.0",
    "imageUrl": "/assets/images/events/event_36323609.png"
  }
]